[ { "learnset" : [ "Bide",
        "Body Slam",
        "Confusion",
        "Counter",
        "Dig",
        "Disable",
        "Double-Edge",
        "Double Team",
        "Flash",
        "Hyper Beam",
        "Kinesis",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Psybeam",
        "Psychic",
        "Psywave",
        "Rage",
        "Recover",
        "Reflect",
        "Rest",
        "Seismic Toss",
        "Skull Bash",
        "Submission",
        "Substitute",
        "Take Down",
        "Teleport",
        "Thunder Wave",
        "Toxic",
        "Tri Attack"
      ],
    "pokemon" : "alakazam",
    "strategies" : [ { "comments" : "",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Psychic" ],
                    [ "Recover" ],
                    [ "Thunder Wave" ],
                    [ "Reflect",
                      "Seismic Toss"
                    ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>While often overshadowed by bulkier and more versatile special sweepers\nin the newer generations, Alakazam fulfills a very important role in\nRBY, working as an effective special wall with Recover while being able\nto put pressure on its opponents with its limited but powerful special\noffense. Access to Thunder Wave coupled with high Speed and its ability\nto force plays with a powerful STAB Psychic makes Alakazam one of the\nbest paralysis spreaders in the game. In addition to coming from a 368\nSpecial stat, Psychic also makes great use of Alakazam's high critical\nhit rate, which, along with Psychic's 30% chance to lower the Special\nstat of your opponent, makes Alakazam very difficult and tricky to deal\nwith at times; this often forces predictable and defensive plays that\nthe user may be able to capitalize on. At the very least, Psychic's\nability to force opponents out, even the number one special wall,\nChansey, should let Alakazam keep spreading the ever dominant paralysis\nas long as what switches in has not already been paralyzed.</p>\n"
        } ]
  },
  { "learnset" : [ "Agility",
        "Bide",
        "Blizzard",
        "Bubble Beam",
        "Double-Edge",
        "Double Team",
        "Fly",
        "Hyper Beam",
        "Ice Beam",
        "Mimic",
        "Mist",
        "Peck",
        "Rage",
        "Razor Wind",
        "Reflect",
        "Rest",
        "Sky Attack",
        "Substitute",
        "Swift",
        "Take Down",
        "Toxic",
        "Water Gun",
        "Whirlwind"
      ],
    "pokemon" : "articuno",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>With Articuno's barren yet focused movepool, there are very few other\noptions it can run. Mimic is probably the best unlisted option, as if\nArticuno gets lucky enough to copy Thunderbolt from Starmie, it will\nalways 2HKO back. Reflect is another option to help Articuno absorb Body\nSlam from Snorlax and even Rock Slide from Golem and Rhydon should it\nfind itself paralyzed against them. It also helps Articuno win against\nTauros, who needs Body Slam critical hits to win. However, it is\ntypically only useful when your opponent's special walls are gone, as\nthey don't care at all whether Reflect is up.</p>\n<h1>Checks and Counters</h1>\n<p>Although Articuno's Blizzard is a frosty nuke and no Pokemon enjoys a\nfreeze, there are quite a few solid counters to it. Lapras is the best\nArticuno counter, as it 4x resists Blizzard. Once it's in, it can wear\ndown Articuno with repeated Thunderbolts or Body Slams or, if it has a\nfree turn, use Confuse Ray on a switch-in. Everything about Starmie\nmakes Articuno's life difficult. It 2x resists Blizzard and can attack\nwith repeated Thunderbolts, paralyze either Articuno or the switch-in\nwith Thunder Wave (except for Rhydon and Golem, who have no business\nfacing a Starmie anyway), and then use any free turns to Recover.\nCloyster also 4x resists Blizzard and has a ton of physical bulk,\nallowing it to absorb any physical attacks that Articuno might be\nrunning, then threaten either Articuno or a switch-in with Clamp,\nBlizzard, or Explosion. Chansey is as good a special wall as ever,\nparalyzing Articuno while firing off Thunderbolts or recovering with\nSoftboiled, but it should be healthy and preferably paralyzed to block a\nfreeze. It also takes 37.9 - 44.6% from Hyper Beam, so it has little\nhope in getting the chance to use Softboiled if its health is low.\nAlakazam can also use Thunder Wave, Recover off any damage, and spam\nPsychic until Articuno eventually faints, but it is 3HKOed by Blizzard,\nproviding it with little time to do all of these things. Finally,\nSlowbro is a decent Pokemon to send out against Articuno one-on-one\nbecause it can paralyze it with Thunder Wave, but switching in is not\nrecommended because it takes about 50% from two Blizzards before it even\nhas a chance to move.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>The best way to get Articuno on the field is to switch it in when you\npredict that your opponent will switch in Exeggutor; if it has lost over\n33% of its health already, Blizzard is a guaranteed KO. It can also\nswitch in on a predicted Earthquake from Snorlax or Tauros, dealing\nheavy damage with Blizzard and hopefully causing a freeze. Rhydon and\nGolem are a bit harder to switch in on, as Rock Slide will KO Articuno,\nbut if you are fortunate enough to switch in on Earthquake, Blizzard\nwill OHKO either. Double-Edge does chip damage to Lapras, who laughs at\na 4x resisted Blizzard, as well as Starmie. Don't use Double-Edge\nagainst Chansey though, as it only does 5% more than Blizzard, causes\nrecoil, and does not have a freeze chance. Don't use Agility until the\nlate-game, when the remains of your opponent's team are within KO range.\nFinally, Hyper Beam is there to finish off weakened Chansey and\nAlakazam.</p>\n<p>Ice Beam is a viable alternative over Double-Edge for a 99.6% accurate\nSTAB, but it is significantly weaker than Blizzard and leaves Articuno\nwalled completely by Lapras and Starmie. Rest is great for recovering\nfrom status, allowing Articuno to act as a status sponge throughout the\nbattle until you need it again. Another interesting option Articuno has\nis Sky Attack, which is its most powerful physical attack, possessing a\nhuge 210 Base Power after STAB. With a critical hit, it is guaranteed to\nOHKO Chansey and has a 52% chance to OHKO Starmie; without a critical\nhit, it has a 46% chance to OHKO Alakazam, who would normally be 3HKOed\nby Blizzard. However, it forces you to lose an entire turn and is\ndifficult to find a slot for on this set.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Blizzard" ],
                    [ "Agility" ],
                    [ "Double-Edge",
                      "Ice Beam",
                      "Rest"
                    ],
                    [ "Hyper Beam" ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Boasting one of the highest Special stats in the game along with the\nmost powerful special move in OU, Blizzard, there's no denying that\nArticuno is a powerhouse. OHKOing Golem and Rhydon and 2HKOing Exeggutor\nare feats few Pokemon can muster, but Blizzard allows Articuno to do\njust that. It can force switches and deal heavy damage throughout the\nmatch, softening up your opponent's team and possibly causing a freeze.\nIt can even make for a very nice end-game sweeper by boosting its\nmediocre base 85 Speed with Agility and blasting away with its STAB\nBlizzard, potentially getting a freeze in the process.</p>\n<p>Why isn't Articuno more common, then? Again, its Speed stat is\nfrustratingly low, as it is not able to outspeed Pokemon like Tauros and\nAlakazam without a boost, while both are capable of paralyzing Articuno.\nIt is walled to kingdom come by the many OU Pokemon that resist\nBlizzard, namely Lapras, Starmie, Cloyster, and to an extent, Slowbro,\nas well as Chansey with its massive 250/105 Special bulk. Its movepool\nis shallow as well, as it leaves Articuno relying on mediocre Ice /\nNormal coverage, the latter of which runs off its so-so Attack stat.\nLapras has several advantages over Articuno as an Ice-type, with higher\nHP stat and much better coverage and utility with Confuse Ray, Body\nSlam, and Thunderbolt. However, even Lapras can never dream of matching\nthe raw power of Articuno's Blizzard. All-in-all, if you are looking to\nunleash a nasty surprise on your opponent, don't overlook Articuno.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Counter",
        "Defense Curl",
        "Double-Edge",
        "Double Slap",
        "Double Team",
        "Egg Bomb",
        "Fire Blast",
        "Flash",
        "Growl",
        "Hyper Beam",
        "Ice Beam",
        "Light Screen",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Minimize",
        "Pound",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Seismic Toss",
        "Sing",
        "Skull Bash",
        "Soft-Boiled",
        "Solar Beam",
        "Strength",
        "Submission",
        "Substitute",
        "Tail Whip",
        "Take Down",
        "Teleport",
        "Thunder",
        "Thunderbolt",
        "Thunder Wave",
        "Toxic",
        "Tri Attack",
        "Water Gun"
      ],
    "pokemon" : "chansey",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Reflect works as an alternative to Counter and helps against physical\nsweepers as well. It is not as game-breaking as Counter, but it doesn't\ncompletely rely on the element of surprise and works against all\nphysical attacks, including Earthquake from Golem and Rhydon, as opposed\nto Counter, which in RBY only works against Normal- and Fighting-type\nattacks. Reflect is especially useful against slow physical sweepers\nsuch as Snorlax, Golem, and Rhydon due to their low critical hit rate;\nit also helps Chansey soak up Explosion from special attackers such as\nExeggutor and Gengar. Reflect Chansey will often lead to stall plays,\nmuch like Reflect Alakazam does. However, Reflect is much more common on\nAlakazam as it's faster and has greater freedom with its moveslots; with\nReflect, Chansey has to drop Thunderbolt or Thunder Wave, which limits\nit against Water-types or reduces its ability to cripple sweepers,\nrespectively.</p>\n<p>Sing is another move Chansey can use effectively, but it's uncommon due\nto its poor accuracy and Thunderbolt's predominance in the last slot.\nThis is not necessarily a bad thing, though, as Sing Chansey is\nunexpected and could let you score a more rewarding sleep against\nopposing Chansey or Snorlax, for instance. Combined with Counter, Sing\nmakes up for a very high-risk, high-reward combination. To pull off this\nstrategy, you need to switch a healthy Chansey into Hyper Beam from the\nlikes of Snorlax or Tauros, put the Hyper Beam user to sleep, and then\nCounter whatever your opponent switches in for an OHKO. However, this\nstrategy has many flaws that limit its effectiveness. First, Sing will\nmiss almost half the time, and if it does, you will be left with a\nChansey in the KO range of the physical sweeper's Body Slam. In\naddition, Chansey will have to drop both Thunderbolt and Thunder Wave,\nwhich will severely limit it. Finally, as Hyper Beam is most commonly\nused mid- or late-game, it's very likely that Sleep Clause will have\nalready been activated.</p>\n<p>While Blizzard is the preferred Ice-type move for most Pokemon, Ice Beam\nis recommended on Chansey, as the extra PP can make a difference in a\nfreeze war or a stall war. Nonetheless, Blizzard's extra power can come\nin handy for wearing down Snorlax on the switch in a bit more quickly,\nas well as for nabbing the 3HKO on Tauros and the OHKO on Dragonite.</p>\n<p>Other gimmicky options for the last slot include Light Screen, Flash,\nSeismic Toss, and Defense Curl; however, it's advised to stick to the\noptions previously mentioned. The former will allow Chansey to\ncompletely wall Slowbro, while the next two help it deal with Alakazam.\nDefense Curl works a bit like Reflect, but has more PP and provides\nboosts that can be stacked. Reflect is overall the best choice for\ndoubling Chansey's Defense in one turn, though.</p>\n<h1>Checks and Counters</h1>\n<p>Due to Chansey's limited offensive power, opposing Chansey and Alakazam\ncan both easily neutralize her attacks thanks to Soft-Boiled and\nRecover, respectively. However, these two cannot recover from a possible\nIce Beam freeze. Chansey can fight back with her own Ice Beam in hopes\nof scoring the freeze first, but keep in mind that paralysis grants\nimmunity to freeze, giving a paralyzed Chansey the edge in the Chansey\nwar. Meanwhile, Alakazam can use STAB Psychic to accumulate Special\ndrops on Chansey; in conjunction with random critical hits and full\nparalysis, this will eventually force Chansey out. However, Psychic will\nrun out of PP quickly. Nevertheless, Alakazam's Recover packs 16 PP more\nthan Chansey's Soft-Boiled, so it's also possible for Alakazam to force\nChansey out by PP stalling, but that increases Chansey's chances to\nfreeze Alakazam if the latter isn't paralyzed. In any case, Chansey can\nswitch back into Alakazam whenever it wants after switching out to\nremove Special drops or avoid wasting PP.</p>\n<p>Chansey can also be dealt with offensively by using strong physical\nattacks. Snorlax is bulky enough to take some hits and can reply with a\npowerful STAB Body Slam or Hyper Beam, eventually beating Chansey unless\nit gets really lucky. If things get bad, Snorlax's Self-Destruct is\npowerful enough to OHKO Chansey. Rest Snorlax is especially useful when\nfighting Chansey, as Rest lets it shrug off paralysis. However, one will\nhave to watch out for threatening sweepers, such as Tauros and Zapdos,\nswitching into it while it is asleep. Rhydon and Golem can switch into\nThunder Wave or Thunderbolt and outspeed a paralyzed Chansey. Rhydon's\nEarthquake will always 2HKO Chansey, and Golem, while not as powerful,\ncan 2HKO with Earthquake and also has access to Explosion to OHKO in\ndire circumstances. These two should watch out for Ice Beam, though, as\nthey take around 60% damage from it. Tauros and Persian hate paralysis,\nbut they can also capitalize on Chansey's weak Defense with their\npowerful STAB Normal-type moves. Persian generally needs Chansey to be\nparalyzed to stand a chance, but if it is, Persian will usually win the\nmatch-up, even if Chansey paralyzes Persian in return. In any case, it's\nnot recommended to switch Tauros or Persian directly into Chansey due to\nthe threat of Thunder Wave. Zapdos and Jolteon can hit Chansey hard with\nDrill Peck and Double Kick, respectively. Jolteon can take hits from\nChansey well, but much like Tauros and Persian, it hates paralysis.\nCloyster, Dragonite, and Victreebel can potentially get past Chansey\nwith their partial trapping moves, especially the latter two, but they\nrely on luck to do so. Exeggutor, Cloyster, Gengar, Snorlax, and Golem\ncan use Explosion against Chansey; Gengar's Explosion is weaker, though,\nand won't OHKO a healthy Chansey.</p>\n<p>Some physical sweeping attempts can be stopped if Chansey packs Counter\nor Reflect, however. Counter is especially dangerous as it might take\nout your Snorlax or Tauros. Reflect's ability to halve damage from\nphysical hits will often lead to stall plays, as it can protect Chansey\nfrom physical sweepers and Explosion, but it will not make a difference\nagainst Persian, who will always score a critical hit with Slash.\nHowever, if Chansey forgoes Thunderbolt, Water-types can take it on.\nStarmie could neutralize Chansey and fish for a Blizzard freeze, while\nSlowbro can easily set up with Amnesia. Lapras and Cloyster are immune\nto freeze and take almost no damage from Chansey's only attacking move,\nIce Beam. If Chansey decides to go without Thunder Wave instead, it\nwould no longer be able to spread paralysis, and fast sweepers such as\nTauros, Persian, Zapdos and Jolteon would now be able to take it on more\neasily. Moreover, the lack of Thunder Wave also limits Chansey against\nSlowbro and users of partial trapping moves.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Ice Beam is Chansey's main attacking move. Without it, Golem and Rhydon\nwould be able to switch in for free, and Chansey would have no chance of\nscoring a freeze, for example, against opposing Chansey. Soft-Boiled is\na must as well, as it allows Chansey to repeatedly sponge attacks and\nrecover HP when necessary. Keeping Chansey at high health whenever\npossible is recommended, as this lets it paralyze Snorlax or Tauros\nbefore having to switch out. Thunder Wave is mostly useful for crippling\nsweepers such as Tauros, Snorlax, Zapdos, and Persian, and often deters\nthem from switching in. Due to the importance of paralysis in RBY,\nThunder Wave is an excellent move against anything except maybe other\nChansey.</p>\n<p>For the last slot, there are two main options. Thunderbolt is the\nrecommended move as it allows Chansey to hit Water-types such as\nStarmie, Lapras, Slowbro, and Cloyster for super effective damage while\nnabbing a fairly strong hit on Jynx. Without Thunderbolt, these Pokemon,\nespecially Starmie, can stay in on Chansey and go for the freeze with\nBlizzard or Ice Beam. While Thunder Wave will still cripple them and\nstill act as a deterrent, Chansey would be setup bait for Slowbro. While\nnot as common, Counter is a viable alternative as well; it will often\nsurprise Normal-type sweepers, such as Snorlax, Tauros, and Persian,\nthat try to capitalize on Chansey's weak Defense. Due to Chansey's\ntitanic HP, Counter will always OHKO Snorlax and Tauros using Body Slam.\nIt should be noted, however, that some players like to check for Counter\nfirst by either using Earthquake or switching back to their own Chansey.\nCounter can also be used for punishing a predicted Hyper Beam. However,\nto do this, Chansey needs to be at full health, as a STAB Hyper Beam can\ndeal around 75% damage.</p>\n<p>One could also drop Thunder Wave instead of Thunderbolt in order to use\nCounter. However, note that Counter does not fully cover physical\nsweepers; Tauros and Snorlax can still use Earthquake, which, in\nconjunction with full paralysis or a well-timed Hyper Beam, will beat\nChansey easily. Replacing Thunder Wave for Counter will also limit\nChansey against Zapdos, Slowbro, and users of partial trapping moves.</p>\n<p>Chansey can only beat opposing Chansey with Ice Beam's freeze chance;\nthe same applies to special attackers such as Starmie and Jynx. Because\nparalysis grants immunity to freeze, a common strategy consists of not\nparalyzing Chansey and fishing for the freeze instead. However, this is\nrisky as, if a freeze war occurs, both players will have a 50% chance of\nscoring the freeze, and the user of the frozen Chansey will be\nsignificantly handicapped for the rest of the battle. Chansey's\nexploitable Defense makes a more offensive approach a viable\nalternative, and is, of course, the path to take should you accidentally\nparalyze it. Powerful physical sweepers should be your main options\nhere; examples include Rhydon, Golem, and especially Snorlax. Tauros is\nnot a recommended pick, however, as its potential to make an impressive\nlate-game impact would be severely reduced if it were to get paralyzed.\nIf looking to apply this strategy, one should first paralyze Chansey.</p>\n<p>When taking the offensive approach, note that even though Snorlax is\nbulky enough to take hits from Chansey, unless you can predict Chansey\nswitch-ins with regularity, Snorlax could get worn down on the switch\nbefore making an impact if it is struggling getting past bulky Pokemon\nsuch as Rhydon, Golem, Exeggutor, Lapras, and especially Cloyster.\nMeanwhile, Rhydon and Golem will need to get past Exeggutor and Starmie,\nand a healthy Chansey can afford to take a hit and retaliate with Ice\nBeam. For this reason, you should be aware that paralyzing Chansey will\ngive your opponent the edge in stall wars, and if your physical sweepers\nstruggle getting past physically bulky and healthy defensive cores, they\nmight get worn down eventually. Nonetheless, there are other Pokemon\nthat will benefit from a paralyzed Chansey, such as Slowbro, Zapdos, and\nJolteon, and Dragonite and Cloyster as well if partial trapping moves\nare not banned. Paralysis is also the way to go if your team does not\npack Chansey.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Ice Beam" ],
                    [ "Soft-Boiled" ],
                    [ "Thunder Wave",
                      "Counter"
                    ],
                    [ "Thunderbolt",
                      "Counter"
                    ]
                  ],
                "name" : "Special Wall",
                "natures" : [  ]
              } ],
          "overview" : "<p>Chansey completely shapes the RBY OU metagame, and is an automatic\naddition to most OU teams. Thanks to its 703 HP, 308 Special, and access\nto Soft-Boiled, there is no special move that can get past Chansey\nwithout taking into account stat modifiers. For reference, the most\npowerful special move in RBY, Articuno's Blizzard, only deals a maximum\ndamage of 25%. This allows Chansey to sponge moves from specially based\nthreats such as Starmie, Lapras, Alakazam, Exeggutor, Jynx, and opposing\nChansey. In addition, because direct paralyzing moves such as Thunder\nWave or Stun Spore mostly come from specially based Pokemon, Chansey\nmakes the best paralysis absorber in the game, as it is potentially able\nto neutralize other paralyzing attempts against your team once it has\nbeen paralyzed. Moreover, paralysis protects Chansey from getting frozen\nwhile not adversely affecting its special walling capabilities.</p>\n<p>However, while Chansey shines on the specially defensive side, its lack\nof STAB and mediocre, Persian-level physical bulk prevent it from being\ncompletely dominant. Specially based Explosion users, such as Exeggutor,\nGengar, and Cloyster, can take out Chansey; powerful physical sweepers,\nsuch as Snorlax, Tauros, Rhydon, and Golem, can also prey on its low\nDefense. However, Chansey can still get past these threats with the\nright move. For example, it outspeeds and 2HKOes Rhydon and Golem with\nIce Beam as long as it isn't paralyzed, and cripples physical attackers\nsuch as Tauros and Snorlax with Thunder Wave. Additionally, it can even\nrun Counter or Reflect to surprise said physical sweepers.</p>\n"
        } ]
  },
  { "learnset" : [ "Aurora Beam",
        "Bide",
        "Blizzard",
        "Bubble Beam",
        "Clamp",
        "Double-Edge",
        "Double Team",
        "Explosion",
        "Hyper Beam",
        "Ice Beam",
        "Leer",
        "Mimic",
        "Rage",
        "Reflect",
        "Rest",
        "Self-Destruct",
        "Spike Cannon",
        "Substitute",
        "Supersonic",
        "Surf",
        "Swift",
        "Tackle",
        "Take Down",
        "Teleport",
        "Toxic",
        "Tri Attack",
        "Water Gun",
        "Withdraw"
      ],
    "pokemon" : "cloyster",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Double-Edge is an option if you fear opponents being able to switch\nGengar or a Rock-type into an Explosion (or Hyper Beam, in the case of a\nRock-type). Rest could work as well to keep Cloyster around even longer,\nmaking him more of a physical tank. Surf is another possibility if you\nwant extra special damage (beware that you will have a hard time dealing\nwith Chansey and friends). Supersonic, Mimic, Substitute, and Reflect\nare also possible fun ideas to throw on Cloyster should he have time to\nmess around.</p>\n<h1>Checks and Counters</h1>\n<p>Starmie and Lapras are Water-types that resist Cloyster's Ice-type\nattacks and can fire back with super effective Thunderbolts. Slowbro is\nanother Water-type, and much more defensively oriented. He shakes off\nCloyster's attacks very easily and can paralyze or wear him down with\nPsychic. Victreebel and Venusaur can put a dent in him with critical hit\nRazor Leafs, but beware of the STAB Ice Beams/Blizzards. Jolteon can fry\nCloyster with its Thunderbolts, as can all the other Electric-type\nPokemon; however, be careful switching in Zapdos, as its Flying typing\ngives it an Ice-type weakness.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Clamp works like Wrap, except it sacrifices some accuracy (it is 75%\naccurate) for increased power and special STAB (Gengar doesn't screw it\nover like it does for Wrap). It cleans up paralyzed Pokemon really\nnicely, and slower ones such as Chansey, Exeggutor, Snorlax, and Hypno.\nAdditionally, if someone switches into Clamp and the attack connects,\nCloyster can switch out next turn while the opposing Pokemon is unable\nto attack. It's definitely a great late-game (or even mid-game) lockout\nmove.</p>\n<p>Blizzard is Cloyster's highest powered STAB special attack. Anything\nthat Surf is effective against, so is Blizzard (in the OU metagame\nanyway). Furthermore, you only suffer a roughly 10% accuracy depletion\nin favor of an extra 25 Base Power. This is one of two moves Cloyster\nwill use to finish off his opponent after Clamping them to within KO\nrange. He won't get enough attacks off to worry about PP, so Ice Beam\nisn't necessary.</p>\n<p>Hyper Beam is his other move, as it takes care of some threats that\nBlizzard can't. For example, after Clamping a paralyzed Chansey,\nAlakazam, or Starmie, Hyper Beam would be the best choice to finish them\noff.</p>\n<p>Explosion is the best choice for the last moveslot. After Clamping a few\nPokemon into watery graves, Cloyster can take down yet another with this\nself-sacrificing move. It's also good as a last resort, or as surprise\ntactic to get rid of something that could become a huge hurdle for your\nteam (such as a Starmie or Tauros). It could be a good strategy to blow\nup Cloyster when you are 2-1 at the end, as well.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Clamp" ],
                    [ "Blizzard" ],
                    [ "Hyper Beam" ],
                    [ "Explosion" ]
                  ],
                "name" : "Clamp",
                "natures" : [  ]
              } ],
          "overview" : "<p>Cloyster can hold his own against Snorlax. He has increased in\npopularity as a Tauros counter considering his massive Defense, though a\nlack of HP hurts him to an extent. Clamp, as all Wrap-like techniques,\nis a great asset, and Explosion is always good. Too bad all Cloyster\nusually does in OU is blow up on Starmie. Don't let this hold you\noff--Cloyster is great to toy with.</p>\n"
        } ]
  },
  { "learnset" : [ "Agility",
        "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Double-Edge",
        "Double Team",
        "Dragon Rage",
        "Fire Blast",
        "Horn Drill",
        "Hyper Beam",
        "Ice Beam",
        "Leer",
        "Mimic",
        "Rage",
        "Razor Wind",
        "Reflect",
        "Rest",
        "Skull Bash",
        "Slam",
        "Strength",
        "Substitute",
        "Surf",
        "Swift",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Thunder Wave",
        "Toxic",
        "Water Gun",
        "Wrap"
      ],
    "pokemon" : "dragonite",
    "strategies" : [ { "comments" : "",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Here it is, possibly the most annoying set in all of Pokemon history.\nIt's more than just annoying, however; it's absolutely deadly if luck is\non your side. Agility boosts Dragonite's Speed above that of any\nunboosted Pokemon in the game. It then proceeds to take advantage of\nWrap's debilitating mechanics by repeatedly using the move to render any\nswitch-in unable to move, while slowly whittling away at the opposing\nPokemon's health. Wrap can even be used to immobilize Gengar, which is\nimmune to Normal-type moves, although Gengar is unlike other Wrap\nvictims in that it does not take damage while incapacitated by Wrap. It\nis, however, not easy to find a good moment to use Agility, due to the\nprevalence of Ice-type and paralysis-inducing moves in RBY. Switching\ninto the occasional sleeping or frozen Pokemon lets Dragonite set up\nAgility safely, however. Otherwise, slow Pokemon such as Golem, Rhydon,\nSnorlax, and Exeggutor that lack Stun Spore are good options to switch\nin and set up on. Taking a hit from them, however, means that Dragonite\nis now OHKOed by unSTAB-boosted Ice-type attacks.</p>\n<p>Once the opponent's Pokemon has been worn down to low enough health,\nDragonite can use one of its other two attacking moves to secure the KO.\nHyper Beam is generally the best option, as it is the strongest attack\nin Dragonite's movepool. Dragonite will usually be able to avoid Hyper\nBeam's incapacitating side effect as Wrap is meant to first put Pokemon\nin Hyper Beam's OHKO range. It lacks STAB, but comes from a base 134\nAttack stat. Surf is the preferred option in the last slot as it\nguarantees an OHKO on the Rock / Ground types Golem and Rhydon. Blizzard\ncan be used in its place to heavily damage Golem and Rhydon, but also to\ngive Dragonite its best direct attack to use against Gengar. It also\nworks as an alternative finishing move for Pokemon such as Zapdos and\nExeggutor and, unlike Hyper Beam, does not force Dragonite to recharge\nif it does not OHKO.</p>\n<p>Dragonite is generally saved for a sweep and, as such, appreciates\nsupport from teammates that can spread paralysis directly. Not only does\nparalysis make Dragonite faster than the opponent without it having to\nuse Agility, but a full paralysis might also save Dragonite if Wrap\nmisses. Alakazam, Chansey, Starmie, Exeggutor, Slowbro, and Zapdos are\nall Pokemon that can perform that role excellently. The former options\ncan tank hits from many threats as well, while the latter two provide\nmore offensive pressure. The choices should depend on how offensive you\nwant your team to be, although it should be noted that Alakazam and\nSlowbro are generally the best options to spread paralysis.</p>\n<p>In addition, Dragonite is able to do more than merely sweep with Wrap;\nif it gets in on a predicted switch to a slow Pokemon, such as\nExeggutor, Snorlax, or Chansey, or on a predicted Earthquake from Rhydon\nor Golem, it can use Wrap against whatever your opponent might decide to\nswitch in. Dragonite can then switch out to a counter, which is\nguaranteed to take no damage from the switch-in thanks to Wrap's\nimmobilization effect. Dragonite's ability to act as a pivot makes it a\ndecent mid-game partner for heavy-hitters such as Snorlax and Rhydon to\nlet them switch in on paralyzed foes with impunity. Moreover, as Wrap\ncan still immobilize Gengar, hard-hitters such as Snorlax, Rhydon,\nGolem, and Tauros also synergize well with Dragonite in this regard. If\nGengar switches into Wrap, you can immediately go to a powerful sweeper\nwithout taking damage thanks to Wrap's mechanics. Earthquake will\ngenerally scare Gengar out, giving Dragonite the possibility of\npunishing whatever your opponent switches in.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Agility" ],
                    [ "Wrap" ],
                    [ "Hyper Beam" ],
                    [ "Surf",
                      "Blizzard"
                    ]
                  ],
                "name" : "AgiliWrap",
                "natures" : [  ]
              } ],
          "overview" : "<p>It's got a wide attacking movepool. It's tied with Mew for the\nsecond-highest Base Stat Total in the game. It's the only fully-evolved\nDragon-type in RBY, a type that sounds legendary on its own and that\nresists the STAB attacks of all three starter Pokemon. It's the final\nPokemon used by Lance, the fourth member of the Elite Four. Clearly,\nDragonite was intended to be some sort of legendary behemoth, the boss\nPokemon to end all boss Pokemon, at least until the player found Mewtwo.\nHowever, in competitive usage, Dragonite is more likely to elicit groans\nand grimaces of irritation rather than the intended screams and wide\neyes of terror. This is because Dragonite's power in OU does not derive\nfrom Hyper Beam, its massive base 134 Attack, its typing, or its diverse\nSpecial movepool. Rather, it's because of an annoying little move that\nits lowly first-stage evolution, Dratini, knows from the start: Wrap.</p>\n<p>Wrap's mechanics differ drastically in RBY compared to later\ngenerations; the move has a mere 15 Base Power, but it prevents the\nopposing Pokemon from making a move while the Wrap user is locked into\nthis move for 2-5 turns. Furthermore, the immobilized opponent cannot\nattack even during the turn the Wrap user switches out, providing a safe\nentry for another Pokemon. However, unlike in other generations, the\nopponent might switch out the Pokemon that is incapacitated by Wrap.\nDragonite is the best Wrap user in RBY because it, unlike any other RBY\nWrapper, also has access to Agility to make it faster than any other\nPokemon in the game. If Dragonite gets lucky and hits all of its Wraps,\nit can totally sweep a team without the opponent even being able to\nmove. This sounds broken, and indeed, some RBY players play with bans on\nWrap and all other moves like it (Bind, Clamp, Fire Spin) because of\ntheir potential. However, Dragonite might always miss a Wrap or two,\nleaving it vulnerable to getting paralyzed or shellacked by an Ice-type\nmove. It is this unreliability that prevents Dragonite from being\nconsidered a staple of RBY OU when Wrap is allowed. When Wrap is not\nallowed, Dragonite is barely worth mentioning in OU due to its lack of\nSTAB, mediocre Speed, and disastrous 4x weakness to the ubiquitous Ice\nBeam and Blizzard.</p>\n"
        } ]
  },
  { "learnset" : [ "Barrage",
        "Bide",
        "Double-Edge",
        "Double Team",
        "Egg Bomb",
        "Explosion",
        "Hyper Beam",
        "Hypnosis",
        "Leech Seed",
        "Mega Drain",
        "Mimic",
        "Poison Powder",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Self-Destruct",
        "Sleep Powder",
        "Solar Beam",
        "Stomp",
        "Strength",
        "Stun Spore",
        "Substitute",
        "Take Down",
        "Teleport",
        "Toxic"
      ],
    "pokemon" : "exeggutor",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Exeggutor is quite versatile for RBY, although it's advisable to stick\nto the standard set's moves. Exeggutor's multitude of resistances and\nits bulkiness allow it to use Rest effectively, especially when combined\nwith paralysis support from other teammates. Hyper Beam is an offensive\nalternative to Double-Edge that can deal around 60% to Alakazam and Jynx\nand almost 50% to Chansey, being useful when they have been previously\nweakened. Leech Seed is not as useful as in newer generations, due to it\nonly draining 1/16 HP, but the HP healed against Chansey is still\nsignificant. Leech Seed and Rest is a gimmicky combination but can\nsometimes work out, especially when your opponent is lacking in\noffensive options. Reflect is another defensive move in Exeggutor's\nmovepool, as it helps it sponge hits from powerful physical attackers,\nsuch as Tauros and Snorlax. Reflect can also be used alongside Rest, but\nthis strategy works better on Hypno due to its lack of a weakness to\nIce-type moves. In general, the moves that scare Exeggutor out come from\nthe special side, except for Zapdos's Drill Peck, so Reflect is\ngenerally a poor move on Exeggutor. Finally, Egg Bomb is a similar move\nto Double-Edge, but it is not recommended due to its low accuracy.</p>\n<h1>Checks and Counters</h1>\n<p>Exeggutor's counters can be arranged into two main groups: the three\nRecover users (Chansey, Alakazam, and Starmie), and other Pokemon that\ncan hit Exeggutor hard with super effective moves, such as Jynx, Lapras,\nand Zapdos. However, note that none of these are sure-fire counters, as\nExeggutor can put one to sleep with Sleep Powder, and use Explosion on\nanother. It's a good idea to send one Pokemon in first to bait the sleep\nmove to activate Sleep Clause. Good examples for this role are Alakazam,\nStarmie, Jynx, Exeggutor, and Gengar as long as you are careful to not\nswitch into Psychic. However, keep in mind that letting your sleeper get\nput to sleep could mean that you won't be able to put anything to sleep\nin the future, unless you have another Pokemon able to induce said\nstatus. Alakazam and Chansey make great counters because they can easily\nshrug off any damage from Exeggutor's Psychic with Recover and\nSoft-Boiled, respectively. Alakazam can also set up Reflect to avoid\nbeing OHKOed by Explosion, but should watch out for Double-Edge when\nswitching in if it is paralyzed. Chansey is a riskier bet because it is\ngenerally more valuable than Alakazam, and you don't want to expose it\nto the threat of Explosion, but it can easily sponge Exeggutor's Psychic\nnonetheless. Starmie works similarly, and can outspeed Exeggutor and\n3HKO it with Blizzard, but it hates paralysis and should also watch out\nfor Mega Drain.</p>\n<p>Jynx is probably the best Exeggutor counter, however. Jynx resists\nExeggutor's Psychic and can scare it with a 2HKO thanks to its STAB\nBlizzard, and has the ability to outspeed Exeggutor and put it to sleep\nwith Lovely Kiss in a lead match-up. Although it is 3HKOed by\nDouble-Edge, Jynx works wonderfully against Exeggutor that lack a\nNormal-type move. Even against Double-Edge variants, Jynx can work as a\ngood check if you predict properly. If Exeggutor takes out Jynx via\nExplosion, it is not all bad news, because that will prevent Exeggutor\nfrom Exploding on other Pokemon, such as Chansey or Alakazam, that are\ngenerally more useful than Jynx. Lapras is a great Exeggutor counter\neven though it doesn't resist Psychic; thanks to its great HP stat,\nPsychic is only a 4HKO. Articuno is a less common alternative to Lapras,\nbut its STAB Blizzard is even more powerful. The other two legendary\nbirds also work well against Exeggutor; Zapdos has a chance to 2HKO\nExeggutor with Drill Peck, while Moltres's Fire Blast will always 2HKO\nit. Cloyster can also 2HKO Exeggutor with Blizzard, but takes over 40%\nfrom Psychic. If you have no better option, your own Exeggutor can also\nwork as a check, being able to take many Psychics, wear it down with\nPsychic or Double-Edge, or threaten it with Explosion or a status move.</p>\n<p>While Gengar, Golem, and Rhydon have no business taking on Exeggutor as\nthey are countered by it, they are useful for switching into a predicted\nExplosion. However, because Exeggutor can hit them very hard with its\nother moves, doing this is very risky if you don't predict correctly. A\nlow health or sleeping Pokemon can be a good alternative to those three\nfor switching into an Exeggutor that might use Explosion.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Thanks to its bulk and useful resistances, Exeggutor is the most\nreliable sleeper in the game, as it will find many opportunities to\nswitch in and put something to sleep via Sleep Powder. Exeggutor has the\nability to take hits from many common Pokemon such as Alakazam,\nExeggutor, Golem, Rhydon, and Gengar, and can easily switch into\nEarthquakes. Exeggutor can also switch into Chansey as it uses\nSoft-Boiled or Thunderbolt. It can even afford to take Body Slams and\nnon-STAB-boosted Ice-type moves in a pinch. However, Exeggutor is slower\nthan the other two common sleepers, Jynx and Gengar, which means that\nthey will be able to put Exeggutor to sleep before it has a chance to\nreciprocate. For this reason, if Exeggutor is the only Pokemon with a\nsleep move on your team, it's a good idea to switch to another Pokemon,\nsuch as Alakazam or Starmie, to take the sleep and save Exeggutor and\nits Sleep Powder for later. Psychic is Exeggutor's main attacking move,\nand hits any non-Psychic-type Pokemon, except for Chansey, very hard.\nExplosion is Exeggutor's best option against Chansey and Alakazam. It is\nalso very useful against other defensive Pokemon, such as Starmie and\nopposing Exeggutor. Explosion can also work as an emergency stop to\nsweepers such as Tauros, Snorlax, Slowbro, and Zapdos. It is a key move\nin Exeggutor's moveset, as Exeggutor's role in most battles consists of\nspreading status, sponging physical attacks generally from Rhydon,\nGolem, or Snorlax, scaring them off with Psychic, and then Exploding on\na wall or an offensive threat.</p>\n<p>There are three main options for the last slot. Stun Spore is probably\nthe most common of the three; it provides a secondary status move,\nallowing Exeggutor to cripple many of its common switch-ins such as\nAlakazam, Starmie, Jynx, Lapras, opposing Exeggutor, and even Chansey.\nIt's also useful for the occasional match-up with Tauros during the\nlate-game part of the battle. Double-Edge can be useful for common\nswitch-ins with low Defense, such as Alakazam and Jynx, hitting them for\naround 40% damage. Double-Edge gives Exeggutor the chance to take out a\nparalyzed Alakazam switching into it without having to resort to\nExplosion, and might even be able to take out a low health Chansey as\nwell. Double-Edge also hits opposing Exeggutor harder, but due to its\nrecoil, and Psychic's chance to score a Special drop, this doesn't give\nExeggutor much of an advantage over opposing Exeggutor. Mega Drain makes\nExeggutor an even better counter to Rhydon and Golem. It is only a 3HKO\non Starmie, so you will have to paralyze it first. Mega Drain's ability\nto regain HP also helps Exeggutor to stick around longer and potentially\nspread more status. Both attacking moves are good options against\nSlowbro, and help put it at low enough health to be KOed by Explosion.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Sleep Powder" ],
                    [ "Psychic" ],
                    [ "Explosion" ],
                    [ "Stun Spore",
                      "Double-Edge",
                      "Mega Drain"
                    ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Exeggutor is one of the most common and useful Pokemon in RBY OU. While\nnot omnipresent like Tauros, Snorlax, and Chansey, it is still an\nexcellent addition to most OU teams. Exeggutor is easy to fit onto a\nteam thanks to its ability to effectively fulfill many important roles.\nWith access to Sleep Powder, Exeggutor is by far the most common sleeper\nin the game, and is often used as a lead. Its unique typing grants it\nuseful resistances to Psychic and Earthquake. Exeggutor is also bulky\nenough to make good use of these resistances. For this reason, Exeggutor\neffectively deals with Golem and Rhydon, and is able to take a few\nPsychics from the likes of Alakazam and opposing Exeggutor. In addition,\na healthy Exeggutor also works as a decent answer to Snorlax and Tauros,\nespecially if you can switch into them as they use Earthquake. While\nlimited, Exeggutor's offenses should not be underestimated either;\nExeggutor's Psychic gets STAB and comes off a 348 Special stat, and\nExplosion can KO Chansey or a Psychic-type trying to tank Psychic.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Body Slam",
        "Confuse Ray",
        "Counter",
        "Double-Edge",
        "Double Team",
        "Dream Eater",
        "Explosion",
        "Hyper Beam",
        "Hypnosis",
        "Lick",
        "Mega Drain",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Night Shade",
        "Psychic",
        "Psywave",
        "Rage",
        "Rest",
        "Seismic Toss",
        "Self-Destruct",
        "Skull Bash",
        "Strength",
        "Submission",
        "Substitute",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic"
      ],
    "pokemon" : "gengar",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Confuse Ray can be used to prevent the opponent from attacking if you\nget lucky—using it against a paralyzed Pokemon can increase that luck in\nyour favor. Psychic is really only useful for hitting other Gengar, but\nis still an option. Night Shade is a decent choice for consistent damage\nto Pokemon that would otherwise take very little from Gengar's attacks,\nsuch as Exeggutor.</p>\n<h1>Checks and Counters</h1>\n<p>Alakazam is the best counter--he's faster and Psychic will do 63-75%\ndamage. Rhydon will OHKO Gengar with Earthquake, and Golem will most of\nthe time--they need to watch out for Mega Drain, though. Starmie will do\na decent amount of damage with Psychic, but Psychic isn't used very\noften on Starmie, and Gengar's Thunderbolt will hurt it very much. Hypno\nand Exeggutor both do a ton of damage with Psychic, but won't OHKO.\nTauros ties Gengar in Speed and will 2HKO him with Earthquake. The best\nway to beat Gengar is to hit him with a strong Earthquake or Psychic, as\nthey will usually 2HKO Gengar.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Sleep the first Pokemon, switch out, and save Gengar for later purposes\nas his Normal immunity comes in handy quite often. When your opponent\nleast expects it, Explode for pretty good damage to anything that\ndoesn't resist it. Mega Drain 2HKOes Golem and Rhydon, and when they are\nnot around, Thunderbolt deals a decent chunk of damage to everything\nelse.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Hypnosis" ],
                    [ "Explosion" ],
                    [ "Thunderbolt" ],
                    [ "Mega Drain" ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Gengar is very useful in many respects. He is the fastest sleep user in\nthe game, has a Normal immunity and very good Special, and can Explode\nwhen the timing is right, making him very difficult to deal with. While\nGengar is the fastest sleeper in the game, Hypnosis will miss almost\nhalf the time. However, despite this shortcoming, Gengar is still a very\ngood lead to sleep the opposing Pokemon. His Normal immunity comes in\nhandy quite often as it's the only surefire way to stop Wrap and can\ncause the opponent to lose a Pokemon if you predict\nExplosion/Self-Destruct correctly. Gengar also packs the second fastest\n(behind Electrode) Explosion in the game, thus allowing him to put a\nstop to any threats causing your team problems before they get out of\nhand. Overall, he is a pretty good choice despite his weakness to\nPsychic and Earthquake, as he is difficult to predict and can screw up\nquite a few common Pokemon in the metagame.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Body Slam",
        "Counter",
        "Defense Curl",
        "Dig",
        "Double-Edge",
        "Double Team",
        "Earthquake",
        "Explosion",
        "Fire Blast",
        "Fissure",
        "Harden",
        "Hyper Beam",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Rage",
        "Rest",
        "Rock Slide",
        "Rock Throw",
        "Seismic Toss",
        "Self-Destruct",
        "Strength",
        "Submission",
        "Substitute",
        "Tackle",
        "Take Down",
        "Toxic"
      ],
    "pokemon" : "golem",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Golem does not have the movepool for any additional options, although\nSubstitute can be used over Rock Slide if you deem Rock Slide to be\nineffective.</p>\n<h1>Checks and Counters</h1>\n<p>Exeggutor is probably Golem's best counter, as it takes very little\ndamage because of its decent defenses, resistance to Earthquake, and\nability to hit back with a 4x super effective Mega Drain or a powerful\nSTAB Psychic. Venusaur and Victreebel can come in on Golem and threaten\nwith Razor Leaf, but will take a large chunk of damage from Earthquake.\nSlowbro takes very little damage because of its great Defense and can\nOHKO with Surf. Starmie can counter it, but will take a powerful\nEarthquake on the switch in for about 45%.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Golem is an extremely valuable Pokemon that should be considered on\nevery team due to its amazing Defense, very good Attack, and important\nresistance to Normal-type attacks. Earthquake and Body Slam are its main\nattacks, with Rock Slide and Explosion playing specialty roles.\nEarthquake is a really solid attack that does plenty of damage to\nanything not immune or resistant to it. Body Slam is the backup, used\nfor predicting switches and inflicting paralysis, something Golem\nappreciates quite a bit. Rock Slide is for any Flying Pokemon that Golem\ncomes across and the odd Lapras or Jynx.</p>\n<p>Explosion is the last ditch effort to remove any problematic Pokemon or\nto do massive damage before Golem is KOed by the opponent. The threat of\nan incoming Explosion will always be on your opponent's mind, and it is\nimportant to not use Explosion at an overly obvious time to avoid\nExploding right into a Gengar or opposing Rock-type. The threat of\nExplosion is a great tool for playing prediction games with your\nopponent, as if you play it right, you can Earthquake a Gengar coming in\nto nullify your Explosion.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Body Slam" ],
                    [ "Earthquake" ],
                    [ "Rock Slide" ],
                    [ "Explosion" ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Golem is one Pokemon (along with Rhydon) that should be considered on\nnearly every team. Its role as a resistance to Normal-type moves and\nimmunity to Electric-type moves cannot be understated. These defensive\ncapabilities cannot be duplicated by any other type of Pokemon, and\neffectively stops several Pokemon from running rampant through the\nmetagame. It completely walls Electric-types (with the exception of Surf\nRaichu) that would normally be game-breaking, he takes Normal-type\nattacks and shrugs them off as if they were nothing, and then he hits\nback with a powerful STAB Earthquake.</p>\n<p>Whether to use Golem or Rhydon has been an age old question for all RBY\nplayers. They each have their advantages over the other, and the\ndecision is completely up to the trainer. Golem is slightly faster and\npacks Explosion, while Rhydon has a higher Attack and can take hits\nslightly better due to its higher HP, although the difference is\nminuscule. Either choice is a solid option and should be considered when\nbuilding a team.</p>\n"
        } ]
  },
  { "learnset" : [ "Agility",
        "Bide",
        "Bite",
        "Body Slam",
        "Double-Edge",
        "Double Kick",
        "Double Team",
        "Flash",
        "Focus Energy",
        "Growl",
        "Mimic",
        "Pin Missile",
        "Quick Attack",
        "Rage",
        "Reflect",
        "Rest",
        "Sand Attack",
        "Skull Bash",
        "Substitute",
        "Swift",
        "Tackle",
        "Tail Whip",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Thunder Shock",
        "Thunder Wave",
        "Toxic"
      ],
    "pokemon" : "jolteon",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Focus Energy is glitched in the Game Boy version of RBY and will leave Jolteon's critical hit rate unchanged, or lower it to 0 if Jolteon is slower than the opponent's Pokemon. However, if you're playing on a platform where Focus Energy works the way it does in Pokemon Stadium, Focus Energy will let Jolteon score a critical hit with nearly every move and is a great choice for its moveset. If using a simulator, make sure you check whether it supports the Pokemon Stadium or Game Boy mechanics before using the attack. Agility can be a good choice despite Jolteon's insane Speed, just because it will allow Jolteon to get its Speed back while paralyzed. Hyper Beam is a desperation move against something like Chansey or Dugtrio that has a moderate chance of paying off with Jolteon's high critical hit rate. Unfortunately, Mimicking Earthquake won't save Jolteon against any Ground-type but it might be useful against some other Pokemon. Tail Whip is an option since it could force switches from Alakazam or Chansey to another Pokemon that Jolteon can paralyze, besides giving Jolteon a slightly better chance of beating Chansey in one-on-one. Substitute helps Jolteon scout the opponent, but note that, except in Stadium situations, it will not prevent status.</p>\n<h1>Checks and Counters</h1>\n<p>Golem and Rhydon, the standard Electric-type counters, work awesomely because of their resistance and/or immunity to most of Jolteon's attacks. Double Kick is super effective, but does very little damage without a critical hit. Chansey takes next to nothing from Thunderbolt, and without a critical hit, Double Kick will not do enough to threaten it. Snorlax is effectively the same as Chansey, but can pose an immediate threat to Jolteon with a super effective Earthquake.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Jolteon's high Speed, high Special, and very high critical hit rate make it a good special sweeper. Thunderbolt is Jolteon's main attack, and Thunder Wave is for paralysis. Pin Missile is a weak multi-hit move, but it does quadruple damage to Exeggutor and all the Poison / Grass types that Thunderbolt isn't very effective against. Despite Pin Missile being one of the few super effective attacks against Psychic-type Pokemon in RBY, Jolteon is usually better off using Thunderbolt against most Psychic-types since Pin Missile is luck based and will, on average, deal less damage than Thunderbolt to them. The last move is mostly filler. Body Slam can possibly paralyze Ground-types on the switch, but won't do much after that. Sand-Attack could let Jolteon survive longer, but requires a ton of luck. Double Kick doesn't deal much damage with Jolteon's low Attack but will still do more damage than any of Jolteon's other attacks to Golem and Rhydon. Whatever move you choose, Jolteon usually works best near the end of a battle when an opponent's Pokemon are weakened. Don't let Jolteon get paralyzed because without its Speed, it is a sitting duck for anything with Earthquake.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Thunderbolt" ],
                    [ "Thunder Wave" ],
                    [ "Pin Missile" ],
                    [ "Body Slam",
                      "Sand Attack",
                      "Double Kick"
                    ]
                  ],
                "name" : "Special Sweeper",
                "natures" : [  ]
              } ],
          "overview" : "<p>Because Jolteon outspeeds everything, it is an excellent late-game sweeper, almost as good as the vaunted Tauros. Jolteon has a critical hit rate through the roof, and this will help it finish off anything not OHKOed by a Normal-type attack. Jolteon, like other Electric-types, is easily walled by Ground-types, but Double Kick does offer it a way to do nearly 36% max in optimal conditions. It is best saved for last and hidden for the match because it has no way to recover and does not take hits very well. A paralyzed Jolteon is really a useless Jolteon, as most physical attackers will easily outspeed and beat it. It is a very good option if you get tired of using Tauros and is actually very fun to use because of its amazing sweeping potential.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Counter",
        "Double-Edge",
        "Double Slap",
        "Double Team",
        "Hyper Beam",
        "Ice Beam",
        "Ice Punch",
        "Lick",
        "Lovely Kiss",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Pound",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Seismic Toss",
        "Skull Bash",
        "Submission",
        "Substitute",
        "Take Down",
        "Teleport",
        "Thrash",
        "Toxic",
        "Water Gun"
      ],
    "pokemon" : "jynx",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Body Slam can catch Starmie on the switch with paralysis, but do not\nexpect to do much damage with it. The chance of paralysis that Body Slam\noffers might often be more useful than anything you can Mimic, so this\nis a very strong option to consider. Counter can KO Tauros when it does\nnot critical hit, and although Tauros can KO Jynx with a non-critical\nhit Hyper Beam (the damage range is 85.9%-101.2%) Jynx has a good chance\nto survive and counter if at full health. Counter is an underrated\noption on Jynx, but it is only useful in a limited amount of situations.\nSnorlax is going to Body Slam Jynx, and if it already switched into a\nBlizzard for 30-33% damage, then Counter is going to most likely KO it\nif it Body Slams Jynx. Minimum damage from Counter on the same turn as a\nTauros Body Slam will do 93% damage to Tauros. However, if either Tauros\nor Snorlax were to critical hit, they would KO Jynx, and if it were to\nbe paralyzed, you might lose Jynx without doing any damage; also, it\nwill be crippled for another Pokemon to come in and finish it off.\nTauros and Snorlax can also just attack Jynx with Earthquake if they are\nreally scared of the possibility of Counter.</p>\n<p>Rest is also a good option, which Jynx can get off against an\nunsuspecting Chansey, which cannot do anything significant to damage it\nbesides Seismic Toss, or Exeggutor, which can only Psychic or\nDouble-Edge Jynx and is forced out when Jynx wakes up. It is highly\nunlikely that Exeggutor would use Explosion on Jynx, but it is also\nunlikely that it will stay in and let Jynx Blizzard it, so expect\nExeggutor to switch out.</p>\n<h1>Checks and Counters</h1>\n<p>Starmie can paralyze Jynx, resists Blizzard and Psychic, and can do\nneutral damage to Jynx with Thunderbolt. However, if your Jynx manages\nto Mimic Thunder Wave or Thunderbolt when Starmie switches in, you might\nreconsider staying in. Alakazam, likewise, can paralyze Jynx, and\nresists Psychic if it manages to switch in on that. It does take\nsomewhat significant damage from Blizzard, but it still gives Jynx\nproblems. Slowbro can switch in, get Amnesia up, and resists both\nBlizzard and Psychic. Even if Jynx manages to Mimic Amnesia, Slowbro\ncompletely destroys it due to type match-ups. Chansey, although it hates\nthe chance of being frozen, takes almost no damage from Jynx's moves,\nwhile doing plenty of damage to any Jynx without Rest. Tauros and\nSnorlax will destroy any Jynx without Counter, and will certainly OHKO\nJynx with a critical hit.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>If Jynx is on your team, it is best to use it as your lead Pokemon. Jynx\nis the fastest Pokemon in the game with a sleep move with at least 75%\naccuracy, and holds an advantage over the most common sleep lead,\nExeggutor, due to Exeggutor's Ice weakness and lack of Speed. Jynx's\ndownside is that it has poor defenses and is slower than Tauros and\nPersian, both of which threaten it.</p>\n<p>You do not necessarily want to use Lovely Kiss on your opponent's lead,\nbecause they might switch to something that is less useful to put to\nsleep, and if you can predict well, then you want to put to sleep the\nbiggest threat you possibly can. If you are not comfortable making that\nprediction, then just use Lovely Kiss on the first turn, because putting\nsomething to sleep is almost always better than putting nothing to\nsleep. A likely switch-in after you have put something to sleep is\nStarmie, and you can make great use of three of Starmie's four likely\nattacks if you use Mimic—Thunderbolt, Thunder Wave, and Recover.</p>\n<p>Psychic from Jynx prevents, among other things, a Pokemon such as Gengar\nfrom safely switching in and putting Jynx to sleep. However, remember\nthat if you keep Jynx in against a lead Gengar, there is a 60%\nprobability your Jynx will be put to sleep; the only way Jynx will OHKO\nGengar is with a critical hit, although Jynx has a high enough Speed and\ntherefore a fairly good chance for a critical hit. Jynx will, in most\nsituations, do the most damage with Blizzard, so there is not often a\ngood reason to use Psychic. The only reason to use Psychic is if you are\nin a situation that you cannot afford a miss or if you want to cause a\nSpecial fall.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Lovely Kiss" ],
                    [ "Blizzard" ],
                    [ "Psychic" ],
                    [ "Mimic" ]
                  ],
                "name" : "Lovely Kiss",
                "natures" : [  ]
              } ],
          "overview" : "<p>Jynx is a quick Pokemon that can surprise people if played properly, and\nis one of the strongest Ice-type attackers in the game due to its decent\nSpecial and STAB Blizzard, but ultimately it is fairly fragile. You'll\nprobably want to lead with Jynx, as you can't switch it into much of\nanything but Psychic, Ice Beam, or Blizzard. Keep your Jynx far away\nfrom Normal Pokemon, Starmie, and Slowbro and she will prove her\neffectiveness. This is a Pokemon that you have to practice with more\nthan other standards to properly execute.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Confuse Ray",
        "Double-Edge",
        "Double Team",
        "Dragon Rage",
        "Growl",
        "Horn Drill",
        "Hydro Pump",
        "Hyper Beam",
        "Ice Beam",
        "Mimic",
        "Mist",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Sing",
        "Skull Bash",
        "Solar Beam",
        "Strength",
        "Substitute",
        "Surf",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic",
        "Water Gun"
      ],
    "pokemon" : "lapras",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Mimic Lapras can become incredibly hard to take down if you get\nsomething like Recover or Thunder Wave from a Starmie. Reflect + Rest\nLapras is also hard to take down if Starmie is incapacitated. Sing\nLapras is a good surprise. Surf isn't generally needed because Blizzard\nalready OHKOes Golem and Rhydon, and Fire-types aren't that common in\nRBY, but it could be useful sometimes against Jynx or low HP Pokemon.</p>\n<h1>Checks and Counters</h1>\n<p>Electric-types (sans Zapdos) can take on Lapras with their super\neffective Thunderbolts as long as they avoid being paralyzed by Body\nSlam. Gengar can use its incredible 130 Special to guard against special\nattacks and its Ghost typing to avoid Body Slam, and hits back very hard\nwith Thunderbolt. Alakazam and Chansey can serve as emergency stops with\ntheir high Special lowering damage from Blizzard and Thunderbolt; they\nshouldn't be relied on too much, though, because their low Defense\nleaves them vulnerable to Body Slam.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Lapras can work against many different Pokemon with its wide variety of\nattacks. Confuse Ray and Body Slam make it one of the best parafusion\nusers in the game. With its high Special, STAB Blizzard is about as\npowerful as Alakazam's Psychic and will even deal a fair amount of\ndamage to Chansey. Additionally, Lapras has a good chance of beating\nstandard Chansey one-on-one with just Body Slam and Confuse Ray, one of\nits main advantages over Starmie. People will often switch confused\nPokemon out for others that have an advantage over Lapras, so you should\ntry to predict this and Thunderbolt Starmie or Body Slam Alakazam. Rest\nLapras is harder to use than the standard set because Rest generally\ndoesn't work in RBY, but with prediction or Confuse Ray support it can\npay off.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Blizzard",
                      "Ice Beam"
                    ],
                    [ "Thunderbolt",
                      "Rest"
                    ],
                    [ "Body Slam",
                      "Rest"
                    ],
                    [ "Confuse Ray" ]
                  ],
                "name" : "Parafusion",
                "natures" : [  ]
              } ],
          "overview" : "<p>Lapras can be a very useful Pokemon due to its variety of attacks and\nbalanced stats. Its good Defense and HP give it much stability, while\nits decent offensive stats let it hit both physically and specially\ndefensive targets hard. Its Speed might seem a bit lackluster, but\nLapras still outspeeds many important Pokemon such as Exeggutor and\nRhydon.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Bite",
        "Body Slam",
        "Bubble Beam",
        "Double-Edge",
        "Double Team",
        "Fury Swipes",
        "Growl",
        "Hyper Beam",
        "Mimic",
        "Pay Day",
        "Rage",
        "Rest",
        "Scratch",
        "Screech",
        "Skull Bash",
        "Slash",
        "Substitute",
        "Swift",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic",
        "Water Gun"
      ],
    "pokemon" : "persian",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>None of the options that haven't already been listed are particularly\nuseful. Don't bother with Thunder as it won't 2HKO Starmie or OHKO\nGyarados. You can use Mimic, but Persian is probably better at using its\nown moves than anything else Mimic could get.</p>\n<h1>Checks and Counters</h1>\n<p>Gengar stops it completely, as the best Persian can hit it with is a\nweak Bubble Beam or Thunderbolt, even though the paralysis chance from\nthe Electric move should be noted. Snorlax is also a good counter as it\ncan take 3 critical hit Slashes thanks to its massive HP while\ndelivering hard-hitting Body Slams. If you can paralyze Persian, it's\npretty much dead. Tauros, Exeggutor, Alakazam, and the legendary birds\ncan take it one-on-one due to their Speed or powerful STAB attacks.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Slash is the main attack you will be using. Hyper Beam is for when you\nneed something a tad stronger or are trying to get a critical hit using\nPersian's Speed. Bubble Beam is to deal with Rhydon and Golem.\nThunderbolt can paralyze Gengar on the switch and hurt Cloyster. Body\nSlam is useful to deal damage with STAB and give a chance at paralysis.\nYou probably won't be using the last move too much anyway, so you don't\nneed to feel hugely pressured with the choice. Screech can be of use,\nespecially against Starmie, which is OHKOed (most of the time) by a\nHyper Beam after a Screech, so they either must switch or risk dying. If\nyou are left one-on-one at the end of the game, Screech will win you the\ngame.</p>\n<p>Screech can help Persian defeat Starmie and Chansey that aren't\nparalyzed. Against Starmie, however, the secret is to Screech and then\nBubble Beam. Bubble Beam would bring Starmie into guaranteed KO range\nfor Hyper Beam, and also has the chance of catching your opponent\nswitching Rhydon or Golem into Persian who aren't aware of this strategy\nand are expecting Hyper Beam.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Slash" ],
                    [ "Bubble Beam" ],
                    [ "Hyper Beam" ],
                    [ "Thunderbolt",
                      "Body Slam",
                      "Screech"
                    ]
                  ],
                "name" : "Slash",
                "natures" : [  ]
              } ],
          "overview" : "<p>Persian is often better used late-game, as it won't be paralyzing many\nPokemon like Tauros would. After most of their team is disabled, Persian\nis wonderful at cleaning up the mess. Being faster than Tauros and as\nfast as Starmie is nice, as most of the time the opponent will not let\nthese Pokemon get paralyzed. Try to keep Persian free of paralysis too,\nas it loses most of its usefulness when it is paralyzed.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Counter",
        "Dig",
        "Double-Edge",
        "Double Team",
        "Earthquake",
        "Fire Blast",
        "Fissure",
        "Fury Attack",
        "Horn Attack",
        "Horn Drill",
        "Hyper Beam",
        "Ice Beam",
        "Leer",
        "Mega Kick",
        "Mega Punch",
        "Mimic",
        "Pay Day",
        "Rage",
        "Rest",
        "Rock Slide",
        "Seismic Toss",
        "Skull Bash",
        "Stomp",
        "Strength",
        "Submission",
        "Substitute",
        "Surf",
        "Tail Whip",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic",
        "Water Gun"
      ],
    "pokemon" : "rhydon",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Horn Drill is an option if OHKO moves are unbanned, although you'd first\nneed to paralyze your foe in order to use it due to Rhydon's low Speed.\nRest and Hyper Beam are usable, but none are especially good options. In\ngeneral, it's better to just stick with the set mentioned above. Don't\nbother with Surf, either: as it's only a 2HKO on Golem, Rhydon will lose\nto it every time anyway.</p>\n<h1>Checks and Counters</h1>\n<p>Exeggutor is the safest switch-in. Tangela, Vaporeon, and Sandslash are\nsure bets, but they're not commonly used. Starmie can also get in on\nRhydon, but watch out for paralysis. Venusaur is also a good counter\ndespite its partial Poison typing letting Earthquake do normal damage.\nLapras doesn't like Rock Slide, so be careful if you try to switch that\nin on a Rhydon. Essentially, Water and Grass Pokemon that can take a hit\nshould be able to counter Rhydon, as most STAB Water and Grass attacks\nnormally OHKO it.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>This set is not very difficult to use. Body Slam paralyzes Starmie and\nExeggutor. Rhydon's Earthquake is the strongest physical attack in the\ngame that doesn't have any kind of drawback, and Rock Slide hurts\nFlying-types for super effective damage.</p>\n<p>The trickiest problem is dealing with Starmie. For example, say you\npredict Starmie will switch in and use Body Slam, and it does switch in\nand you are lucky and Body Slam paralyzes Starmie. After that, you can\n2HKO Starmie, but if it has Surf it will OHKO Rhydon. After this, you\nought to use Substitute and hope that Starmie gets fully paralyzed.\nMaybe it won't, but Rhydon will be able to set up 4 Substitutes before\nrunning out of HP and then it will have one more chance of using\nEarthquake before Starmie finishes it off, meaning it has a 76% chance\nof getting off 2 Earthquakes against that Starmie (as well as a\nreasonable chance of finishing it off with a Substitute still intact,\nshould it get fully paralyzed twice).</p>\n<p>Do not use Substitute before you have another Pokemon asleep (activating\nSleep Clause), because it is too easy for Exeggutor to switch in for\nfree while Rhydon does 25% damage to itself; it can then get put to\nsleep by a quicker Exeggutor.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Earthquake" ],
                    [ "Rock Slide" ],
                    [ "Substitute" ],
                    [ "Body Slam" ]
                  ],
                "name" : "Physical Sweeper",
                "natures" : [  ]
              } ],
          "overview" : "<p>Rhydon and its Ground / Rock friends are the only true counters to\nZapdos, which lacks the traditional Electric weakness and effectively\nDrill Pecks every other potential Electric counter. It's not easy to\nswitch in due to a very low Special and many weaknesses, but Rhydon will\ndent whatever switches in against it. The best opportunity comes against\nsomething Rhydon fully counters, such as Dodrio or an Electric-type. Its\nability to kill an incoming Starmie with some luck can't be ignored.\nRhydon is strong late-game at finishing off teams of paralyzed Pokemon.\nIt is usually not paralyzed itself due to its Thunder Wave immunity.\nWith some prediction, Rhydon can switch into Hyper Beams for a free\nattack and take Explosions without dying.</p>\n"
        } ]
  },
  { "learnset" : [ "Amnesia",
        "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Confusion",
        "Counter",
        "Dig",
        "Disable",
        "Double-Edge",
        "Double Team",
        "Earthquake",
        "Fire Blast",
        "Fissure",
        "Flash",
        "Growl",
        "Headbutt",
        "Hyper Beam",
        "Ice Beam",
        "Mega Kick",
        "Mega Punch",
        "Mimic",
        "Pay Day",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Seismic Toss",
        "Skull Bash",
        "Strength",
        "Submission",
        "Substitute",
        "Surf",
        "Swift",
        "Take Down",
        "Teleport",
        "Thunder Wave",
        "Toxic",
        "Tri Attack",
        "Water Gun",
        "Withdraw"
      ],
    "pokemon" : "slowbro",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Psychic is a STAB alternative to Surf, and trades 5 extra power for a\n30% chance of scoring a Special fall. As far as type effectiveness is\nconcerned, Psychic gains a neutral hit against Lapras and Cloyster and a\nsuper effective hit against Gengar and Victreebel, three of which are\neffective Slowbro checks, but loses the neutral hit against Alakazam as\nwell as the ability to OHKO Golem and Rhydon at +0, needing two Amnesia\nboosts to OHKO them. Seismic Toss Alakazam in particular will have the\nopportunity to force you to Rest before Slowbro is able to get past it.\nPsychic's lower PP could also be a problem against users of recovery\nmoves, especially considering that, without Surf, Alakazam will also\nrequire more time to take down. It could also be an issue if your\nopponent keeps using Recover or Soft-Boiled and gets lucky with full\nparalysis. Having 8 less PP could also be significant in an odd Slowbro\nwar.</p>\n<p>Ice Beam is another attacking move Slowbro can use. Its biggest upside\nis hitting Grass-types and Zapdos for super effective damage, including\nExeggutor and Victreebel. Ice Beam will often surprise Exeggutor,\nOHKOing it at +6. At the very least, it will force Exeggutor to use\nExplosion earlier, making it more predictable. Meanwhile, Zapdos is\n2HKOed by a +2 Ice Beam and OHKOed when Slowbro is at +6. Ice Beam's\nfreeze chance might also save you in a pinch and could make a difference\nagainst another Slowbro or Amnesia Snorlax. Ice Beam, however, should\nonly be used over Thunder Wave, because the STAB move is necessary to\n2HKO Chansey and Starmie. Withdraw has the same goal as Reflect, with\nthe difference that it can maximize Slowbro's Defense, but requires two\nturns to reach Reflect's potential. Reflect will generally turn out to\nbe more useful and safer. Withdraw's high PP will let Slowbro outstall\nother Slowbro, however. Counter can surprise common Slowbro switch-ins\nlike Starmie if you switch into a Body Slam from a physical attacker and\nscare it out, or if you predict a Hyper Beam. Counter has hardly any\nother uses other than these though, because Slowbro generally only takes\nphysical attacks when it's asleep, excluding Explosion. Disable is a\nfunny option that can prevent some Pokemon from Thunderbolting Slowbro\nfor some time, but it's very unreliable and shouldn't really be used.</p>\n<h1>Checks and Counters</h1>\n<p>Starmie or Chansey packing Light Screen will completely counter Slowbro\nunless they get really unlucky with full paralysis. Light Screen is\nnever seen on them, however, as it has no use outside of walling\nSlowbro. Victreebel and Venusaur are known for having a guaranteed\ncritical hit in their STAB signature move, Razor Leaf. They won't like\nswitching into a Thunder Wave, and could be surprised and OHKOed by a\nboosted STAB Psychic, but, otherwise, either of the Grass-types can KO\nSlowbro when it is below 70% or 2HKO it while it is Resting.</p>\n<p>Apart from these, Slowbro has no safe counters. Thunderbolt users are\npossible choices; the higher their critical hit ratio and amount of\nturns they can resist Slowbro's Surf, the better counters they are.\nStarmie is a good choice, having a very high Speed and thus a high\ncritical hit ratio, while also resisting all of Slowbro's moves. It's\nnot a surefire counter though, and in case Starmie prevails, it won't\nlike having to eat a Thunder Wave. Gengar makes a good choice too,\nhaving a high critical hit ratio and being able to Explode for around\n50% damage when it's about to die. However, it doesn't resist Surf and\nis weak to Psychic. Zapdos and Jolteon have the luxury of getting STAB\nin their Electric-type attacks; even when Slowbro is at +6, their\nThunderbolts will still do significant damage. They also have a high\ncritical hit ratio, but like Gengar, they don't resist Surf, and, unlike\nGengar, can't Explode. Regarding Explosion, it makes a very viable\nchoice for taking Slowbro down when you have no other option. It won't\nOHKO a healthy Slowbro, but could put it in the KO range of Tauros's\nHyper Beam or Rhydon or Golem's Earthquake. Pokemon with Explosion\ninclude Exeggutor, Snorlax, Golem, Cloyster, and Gengar, although\nGengar's Explosion is weaker. A Resting Slowbro that gets Exploded on is\npretty much a dead Slowbro.</p>\n<p>Amnesia Snorlax will often defeat Slowbro, as its Body Slam is an almost\nguaranteed 4HKO while Slowbro's Surf only manages a 5HKO when both are\nat +6. Due to the Speed tie, a 4HKO could turn into a 3HKO, depending on\nwho goes first the turn Slowbro uses Rest. If Snorlax is packing\nThunderbolt instead, it will fare even better, 3HKOing Slowbro after\nboth have set up. As far as the physical side goes, Rhydon makes a\nsurprisingly viable option, although risky as well; it has to switch in\nwhen Slowbro uses Rest, and then try to 3HKO it with its STAB\nEarthquake, which will happen around 75-80% of the time. Tauros needs a\ncritical hit Body Slam to get the chance to 3HKO it after finishing it\noff with a Hyper Beam. If Tauros gets paralyzed, though, you can pretty\nmuch forget about beating Slowbro. Snorlax's critical hit ratio is much\nsmaller than Tauros's, but its Body Slam is almost a guaranteed 4HKO,\nand has an easier chance if Body Slam paralyzes Slowbro. For instance,\nif Snorlax moves first while Slowbro tries to use Rest, but moved last\non the previous turn that Slowbro Rested, Snorlax beats Slowbro with\nonly Body Slam. Both Tauros and physical Snorlax should really be\ncareful when trying to counter Slowbro and should generally only be sent\nin when Slowbro is sleeping because they will otherwise die to\npreviously-boosted Surfs more often than not.</p>\n<p>If Slowbro's set contains Reflect, though, trying to counter it with\nphysical attacks becomes impractical unless you are willing to sacrifice\nat least two Exploders. In this case, however, any unparalyzed\nThunderbolt user becomes a much more effective check, including the slow\nones, such as Chansey and Lapras, which, despite their low critical hit\nrate, will get more chances to fish for it, as it's much more likely\nthat Slowbro is forced to Rest more often. Chansey and especially\nStarmie will get the chance to keep using their recovery move until\nSlowbro gets fully paralyzed, which is when they get the chance to use\nThunderbolt. Starmie is much better at doing this because Recover\noutlasts Surf in terms of PP.</p>\n<p>It's worth noting that Slowbro, as a Rest user, is one of those Pokemon\nthat should be attacked whenever given the chance, because when it's\nResting, you can apply a much higher and more effective variety of\ntactics to try to take it down. Exeggutor's Mega Drain and Alakazam and\nJynx's Seismic Toss, for instance, may not do enough to kill Slowbro,\nbut will cause some decent damage on it before being forced to switch\nout, which will force it to Rest earlier than desired.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Amnesia" ],
                    [ "Surf" ],
                    [ "Thunder Wave" ],
                    [ "Rest" ]
                  ],
                "name" : "Tobybro",
                "natures" : [  ]
              } ],
          "overview" : ""
        } ]
  },
  { "learnset" : [ "Amnesia",
        "Bide",
        "Blizzard",
        "Body Slam",
        "Bubble Beam",
        "Counter",
        "Double-Edge",
        "Double Team",
        "Earthquake",
        "Fire Blast",
        "Fissure",
        "Harden",
        "Headbutt",
        "Hyper Beam",
        "Ice Beam",
        "Mega Kick",
        "Mega Punch",
        "Metronome",
        "Mimic",
        "Pay Day",
        "Psychic",
        "Psywave",
        "Rage",
        "Reflect",
        "Rest",
        "Rock Slide",
        "Seismic Toss",
        "Self-Destruct",
        "Skull Bash",
        "Solar Beam",
        "Strength",
        "Submission",
        "Substitute",
        "Surf",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic",
        "Water Gun"
      ],
    "pokemon" : "snorlax",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>A physical set with Rest is also viable. Rest often lets Snorlax survive\na lot longer, especially after spreading some paralysis. However, its\nmost rewarding use is shrugging off the attacks Chansey fires at Snorlax\nwhen switching into her and waking up against her, thus letting Snorlax\ncome into Chansey more comfortably. Reflect is commonly used in this\nset, and protects Snorlax from physical sweepers such as opposing\nSnorlax, Rhydon, Golem, and even Tauros while sleeping; it also halves\nthe damage from Explosion.</p>\n<p>Using both Reflect and Amnesia in the same set is another possible\ncombination. After setting up, only a high number of critical hits or\ndouble Explosions will beat a Snorlax with this set, so with some\nparalysis support and residual damage, it's very difficult for the\nopponent to take him down. However, depending on the damaging move you\nchoose, there will always be something you will have difficulty getting\npast. Body Slam is preferable because it beats Chansey with regularity.</p>\n<p>Counter is rarely seen on Snorlax, but can be effective for match-ups\nwith Tauros or Snorlax, and for coming into predicted Hyper Beams from\nthem. However, using it means dropping Hyper Beam, which will limit\nSnorlax's offensive power. Thunderbolt and Thunder will hit Cloyster\nharder, making them viable options if Wrap and similar moves are\nallowed.</p>\n<h1>Checks and Counters</h1>\n<p>Snorlax is probably the second most difficult to wall Pokemon in OU\nafter Tauros. Cloyster is probably the safest Snorlax switch-in. If you\ncan paralyze Snorlax beforehand, Rest Cloyster will comfortably keep\nusing Rest against Snorlax. However, Cloyster is 3HKOed by Thunderbolt\nand 2HKOed Thunder, but these moves are almost never seen on Snorlax,\nexcept on the Amnesia set. Lapras's and Articuno's physical bulkiness\nare slightly smaller, but with Rest, they are also usually able to wall\na paralyzed Snorlax. Slowbro has the ability to set up on Snorlax and\ncan take Body Slams well. Golem and Rhydon can easily switch into a Body\nSlam, although paralysis will cripple them. These Rock-types will at\nleast ensure Snorlax is not using Body Slam again, so you can switch out\nto a Pokemon such as Lapras or Exeggutor if you fear Surf. However, if\nSnorlax is indeed packing Surf, prediction is necessary if you want to\nuse the Rock-type Pokemon. If Snorlax is using Surf over Earthquake,\nthough, Gengar will easily be able to take on Snorlax.</p>\n<p>Paralysis will cripple Snorlax in general, making him easier to wall,\nbut Chansey and Alakazam, the most common users of paralyzing moves,\ncan't switch into Snorlax. However, if Snorlax switches into any of\nthese Pokemon, staying in to paralyze him is advisable if their health\nis high. However, Alakazam can still set up Reflect and will usually win\nthe match-up or force Snorlax out due to his low critical hit rate. If\nyour opponent surprises you with an Amnesia set, your best bet is\nusually using Explosion or Self-Destruct on it with Pokemon such as\nExeggutor, Golem, Gengar, or even your own Snorlax, unless you think you\ncan take it down with, for example, Tauros or Snorlax before he can set\nup.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>This is by far the most common Snorlax moveset, and thus, the moveset\neverybody expects when battling him. Body Slam is Snorlax's main attack,\nand it hits most things that don't resist it hard while having a 30%\nchance of paralyzing the opponent. Hyper Beam is a finishing move that\nwill let Snorlax KO most things below 50% health. Your opponent might\nsee Hyper Beam coming, but unless they have a Golem, Rhydon, or a\nhealthy Pokemon with Counter, they will be hard-pressed to respond to\nit.</p>\n<p>Earthquake is mostly for Golem, Rhydon, and Gengar, all of which would\notherwise take on mono-Normal Snorlax easily. It can also check for\nCounter on certain Pokemon, especially Chansey, which will KO it if it\nattacks her with Body Slam. Surf is another popular choice to hit Golem\nand Rhydon, two of the best Snorlax switch-ins, a lot harder than\nEarthquake and usually KOes them after a Body Slam. However, if you drop\nEarthquake, Snorlax will be pretty worthless against Gengar and Counter\nChansey; forgoing Hyper Beam will limit Snorlax's offense against\neverything in general, especially towards the end of the game.</p>\n<p>On the defensive side, Rhydon and Golem are among the most common\nSnorlax switch-ins, so at least one Pokemon that can switch into them a\nfew times, such as Exeggutor or Starmie, is recommended as a teammate\nunless Snorlax packs Surf. Other bulky Pokemon such as Lapras, Cloyster,\nand Exeggutor might also switch into Snorlax, so Chansey, Alakazam,\nand/or Starmie will help to neutralize them. Alakazam, Chansey, and\nStarmie, as well as other Pokemon such as Exeggutor and Slowbro, will\nalso be able to spread some paralysis, which will speed up Snorlax's\noffense.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Body Slam" ],
                    [ "Hyper Beam",
                      "Surf"
                    ],
                    [ "Earthquake",
                      "Surf"
                    ],
                    [ "Self-Destruct" ]
                  ],
                "name" : "Fishlax",
                "natures" : [  ]
              },
              { "abilities" : [  ],
                "description" : "<p>This set works like Slowbro, but trades an Electric-type neutrality for\na special STAB move and Thunder Wave. In match-ups against physical\nPokemon, with Blizzard, Snorlax will only need to use Amnesia once, as\n456 Special is usually enough to 2HKO Tauros and will always let Snorlax\nOHKO Rhydon and Golem, as well as 3HKO opposing Snorlax. Ice Beam can be\nuseful against Chansey with Reflect or Counter; otherwise, the extra PP\nis not needed, even if Snorlax is using Rest.</p>\n<p>Thunderbolt lets Snorlax take on Water-types more easily, especially\nCloyster and Slowbro. Body Slam is his best move to fight Chansey, as\nBlizzard will quickly run of PP against it and Ice Beam fails to 3HKO;\nhowever, Ice Beam and Thunderbolt might also let Snorlax PP stall\nChansey out of Soft-Boiled as long as Snorlax doesn't get frozen\nbeforehand. Body Slam also helps if Snorlax isn't able to get in a few\nboosts quickly enough, for example against Alakazam; unfortunately, if\nyou do not opt to use Blizzard or Body Slam, Snorlax will fare worse in\nphysical match-ups. Rest is the preferred move on this set to let\nSnorlax continue sweeping after set up, but you should watch out for\nyour opponent predicting its use and going to a physical sweeper.\nSelf-Destruct is a good, often unexpected option and especially useful\nfor when Snorlax doesn't have time to set up.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Amnesia" ],
                    [ "Blizzard",
                      "Ice Beam"
                    ],
                    [ "Body Slam",
                      "Thunderbolt"
                    ],
                    [ "Rest",
                      "Self-Destruct"
                    ]
                  ],
                "name" : "Amnesialax",
                "natures" : [  ]
              }
            ],
          "overview" : "<p>Snorlax is one of the most dominant and dangerous Pokemon in OU. Despite\nhaving the lowest Speed in RBY, only tied with Slowbro, Snorlax has one\nof the best stat distributions in the game, which, along with his\npowerful attacking options, lets Snorlax go one-on-one against almost\nevery Pokemon in the game if he wants to. Add STAB Self-Destruct to the\nmix, and Snorlax will often be able to net you two kills. Snorlax is\nespecially useful for capitalizing on a paralyzed Chansey and is one of\nthe main reasons you might want to paralyze Chansey rather than go for\nthe freeze in the first place. Snorlax is also the most versatile\nPokemon in RBY due to its ability to use unexpected moves such as Rest,\nReflect, Amnesia, and Counter effectively. Snorlax is so good that he is\noften a brainless addition when making a RBY OU team.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Bubble Beam",
        "Double-Edge",
        "Double Team",
        "Flash",
        "Harden",
        "Hydro Pump",
        "Hyper Beam",
        "Ice Beam",
        "Light Screen",
        "Mimic",
        "Minimize",
        "Psychic",
        "Psywave",
        "Rage",
        "Recover",
        "Reflect",
        "Rest",
        "Skull Bash",
        "Substitute",
        "Surf",
        "Swift",
        "Tackle",
        "Take Down",
        "Teleport",
        "Thunder",
        "Thunderbolt",
        "Thunder Wave",
        "Toxic",
        "Tri Attack",
        "Water Gun"
      ],
    "pokemon" : "starmie",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Surf and Hydro Pump are STAB options that increase Starmie's power\nagainst neutral targets such as Normal-types, Alakazam, and Jynx. Surf,\nespecially, makes Starmie an even better Golem and Rhydon check, as it\nwill OHKO them. In order to use any of these two moves, you should\nchoose between forgoing Thunder Wave's support or dropping Blizzard.\nDoing the latter means losing super effective coverage against\nExeggutor. Starmie will still be able to wall it, but Exeggutor will now\nhave plenty of time to paralyze Starmie, fish for Special falls, set up\nExplosion, or even replenish its health with Mega Drain as you while\nStarmie tries to stall it out with Recover. While Surf is the most\nconsistent and common option, Hydro Pump can 2HKO Tauros and will 3HKO\nSnorlax and Alakazam. As an example, Surf increases Starmie's chances of\nbeating Alakazam one-on-one, sometimes after Alakazam gets fully\nparalyzed twice in a row. Hydro Pump's fewer PP makes this more\ndifficult, but its ability to 3HKO Alakazam might let Starmie beat a\nparalyzed one switching into a Hydro Pump after a critical hit or a full\nparalysis without taking a Thunder Wave in the process. Surf is commonly\nused over Blizzard while Hydro Pump is usually used along with BoltBeam\nfor a more dedicated sweeper.</p>\n<p>Ice Beam is the general Ice-type alternative move to Blizzard, but it's\ngenerally an inferior choice on Starmie. Ice Beam's main selling point\nis its higher PP, which is useful for freeze wars, but Starmie can't\nstay in against Thunderbolt Chansey anyway. Although Ice Beam could\nactually be useful for Alakazam and Thunderbolt-less Chansey stall wars,\nBlizzard is usually Starmie's strongest move, so the inferior power will\noften be significant when using Ice Beam instead. Psychic is another\nattacking option sometimes used on Starmie leads to 2HKO Gengar.\nPsychic's ability to hit Victreebel super effectively is also noteworthy\nif you are planning to drop Blizzard for it. However, unlike Surf and\nHydro Pump, Psychic only hits Alakazam, Jynx, and Hypno for resisted\ndamage. Psychic's main disadvantage is arguably that it only 3HKOes\nGolem and Rhydon. Compared to Surf, Psychic has 5 less Base Power and 8\nfewer PP, but boasts a 30% chance of scoring a Special fall. Hyper Beam\nis the only move in Starmie's movepool that might bother Chansey, and\nmight come in handy against Alakazam as well. Hyper Beam does 35-41% to\nit, which means that Starmie could surprise a weakened (<50%) Chansey\nattempting to switch in on it. In addition, in desperate situations, a\ncritical hit Hyper Beam can do up to 80% to Chansey and sometimes OHKO\nAlakazam. Hyper Beam is a very situational move though.</p>\n<p>Starmie can learn both Reflect and Light Screen, but neither is\nparticularly useful on it. Light Screen won't prevent Chansey from\ncountering Starmie, although it can help against Slowbro. Regarding\nReflect, Starmie is going to be met with Chansey (or Alakazam) almost\nevery time it comes in. Even if the opposing physical attacker stays in,\nyou should probably just attack, because once you set up Reflect, your\nopponent will go straight away to Chansey, so you have likely just\nexchanged half a Body Slam, with its 30% paralysis chance, for 0 damage\nin return. Reflect is only useful when the opponent is only left with\nphysical sweepers, when it could admittedly make a difference.</p>\n<h1>Checks and Counters</h1>\n<p>Chansey is by far the safest Starmie counter, as it takes pitiful damage\nfrom Starmie's attacks and threatens Starmie with paralysis and a\nlikely-to-2HKO Thunderbolt, and can even use Soft-Boiled whenever\nnecessary. Chansey only has to worry about Blizzard's 10% freeze chance\n(only 9% factoring in accuracy) as it switches in, but if Chansey is\nparalyzed, Starmie becomes completely worthless against it: Chansey can\nsimply paralyze Starmie and fire off Thunderbolt until Starmie gets\nfully paralyzed or Chansey scores a winning critical hit. Alakazam can\ngenerally shrug off Starmie's attacks with Recover, but a Starmie\npacking Surf might be more problematic. Alakazam is also susceptible to\nbeing frozen but the threat of paralysis is generally enough to scare\nStarmie away; Starmie can't handle Alakazam's Seismic Tosses well\neither.</p>\n<p>The two Electric-types, Zapdos and Jolteon, can abuse Starmie's weakness\nto Electric-type attacks with their STAB Thunderbolts. Jolteon is\ngenerally a better Starmie check than Zapdos, as it can outspeed Starmie\nand isn't weak to Blizzard. Neither of the two will enjoy being\nparalyzed by Thunder Wave though. Victreebel and Venusaur can hit\nStarmie super effectively with STAB Razor Leaf, but Starmie also hits\nthem for super effective damage in return with Blizzard or Psychic, and\nStarmie is faster than both of the two Grass-types.</p>\n<p>Paralysis provides a great way to weaken Starmie and make it less\neffective, both offensively and defensively. Stun Spore Exeggutor and\nThunder Wave Slowbro will sometimes end up hitting Starmie, while Body\nSlams might paralyze it as well, depending on which Pokemon your\nopponent sends Starmie into. Exploding on Starmie with Exeggutor or\nSnorlax can work in a pinch, while Cloyster and Golem can sometimes lure\nStarmie in and Explode on it in the switch in, but this is riskier.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>This is by far the most common Starmie moveset due to its great\nversatility. Blizzard hits Exeggutor, Zapdos, Golem, and Rhydon for\nsuper effective damage, and is also the most powerful move of the set to\ndeal with neutral targets, such as Normal- and Psychic-types. The 10%\nfreeze chance is never a bad thing either, and might prove game-deciding\nin on one of the many times Chansey will likely switch into Starmie.\nThunderbolt, meanwhile, deals super effective damage to Water-types such\nas Starmie, Lapras, Slowbro, and Cloyster, all of which resist Blizzard.\nThunder Wave can act as a deterrent to physical or mixed attackers such\nas Tauros, Snorlax, Persian, and various Electric-types. Be careful,\nhowever, as Chansey will often switch into Starmie, and a paralyzed\nChansey could become more problematic than an unparalyzed one. Still,\nThunder Wave is a great move to have for defensive purposes.</p>\n<p>Thanks to its access to Recover and its typing, Starmie has multiple\ndefensive uses. Like Alakazam, it can be a lead sleep absorber, as it\ncan tank other moves from Exeggutor and Jynx, and also hit them before\nthey can move. Blizzard can do heavy damage to Exeggutor and, with some\nluck--namely a critical hit or a few Sleep Powder misses--can put\nStarmie in a position where it can KO Exeggutor without being put to\nsleep. Starmie doesn't fare well against Gengar though, since\nThunderbolt will 2HKO it.</p>\n<p>Starmie can also be saved for the battle in order to make use of its\ngreat defensive coverage. If a teammate has already been put to sleep,\nStarmie can neutralize Exeggutor, which will find itself forced to use\nExplosion in order to take Starmie out, --and even that will not OHKO a\nfull-health Starmie. Mega Drain Exeggutor might have a chance to KO\nparalyzed Starmie, but Exeggutor never packs Stun Spore and Mega Drain\nin the same moveset, so this only applies if Starmie has been previously\nparalyzed. Jynx will also get worn down by Starmie eventually, and will\nonly succeed if Blizzard freezes it before, which one can expect to\nhappen around one-third of the time assuming Jynx started at full\nhealth. A paralyzed Starmie is usually a hard counter to Jynx, though,\nunless Jynx is packing Seismic Toss and gets very lucky with full\nparalysis.</p>\n<p>Starmie also makes an effective check to Golem and Rhydon, as it is able\nto switch into Earthquake and Recover off the damage while scaring them\nout with a super effective Blizzard. However, note that two high-roll\nEarthquakes from Rhydon will 2HKO Starmie, while Starmie can't OHKO in\nreturn without a Water-type attack. Meanwhile, Golem has a chance to\nOHKO Starmie with Explosion; Starmie won't like the occasional paralysis\nfrom Body Slam either.</p>\n<p>Starmie is the best Cloyster counter in the game, as it outspeeds\nCloyster, 2HKOes it with Thunderbolt, resists Clamp and Blizzard, and\neven survives Explosion at full health. Cloyster can still immobilize\nStarmie to set up a switch-in without taking damage, however. Continuing\nwith Water-type Pokemon, Starmie's high-critical-hit-ratio Thunderbolt\nis known for being a pain for Slowbro. However, Starmie is not a 100%\nSlowbro counter at all, as Slowbro can paralyze Starmie with Thunder\nWave and sometimes get past it via boosted Surfs without suffering a\ndeadly critical hit. Starmie also makes a decent Lapras check, as it is\nonly 3HKOed by Lapras's Thunderbolt while being able to paralyze Lapras\nin return and deal around 33% damage to Lapras with its own Thunderbolt.\nStarmie can at least work as a pivot, so that another Pokemon, such as\nChansey, can switch into a safe Thunderbolt. Lastly, Starmie can also\nswitch into Alakazam to start a stall war, and it might even have the\nupper hand due to Blizzard's freeze chance. However, it won't like\neating a Thunder Wave, while Alakazam might not care as much about being\nparalyzed in return.</p>\n<p>It should be noted that while Starmie loses the ability to check some of\nthese Pokemon when it's paralyzed (for example, Cloyster and the\nRock-types), checking some of the other Pokemon, such as Exeggutor and\nSlowbro, involve taking the risk of being hit by a paralysis move in the\nprocess, so you should decide which Pokemon are more important to check.\nIn addition, a paralyzed Starmie loses much of its sweeping capability\neven after Chansey is gone, as well as the ability to potentially take\non or switch into physical sweepers such as Tauros in a pinch with the\nsame effectiveness.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Blizzard" ],
                    [ "Thunderbolt" ],
                    [ "Recover" ],
                    [ "Thunder Wave" ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Access to Recover and a Psychic typing are both often synonyms of\nsuccess in RBY. Starmie is no exception, shining in the oldest\ngeneration as one of the best defensive Pokemon, while still posing a\nthreat offensively when Chansey is gone. Beyond this, Starmie has even\nmore things going for it. Starmie's great Speed lets it outspeed every\nOU Pokemon not named Alakazam or Jolteon and provides it with one of the\nhighest critical hit ratios. Starmie's movepool is also perfectly suited\nfor it: in addition to STAB Surf, Hydro Pump, and Psychic, it also\nreceives Blizzard and Thunderbolt, which make up the famous BoltBeam\ncombination. Furthermore, it learns Thunder Wave, one of the best moves\nin RBY.</p>\n<p>Starmie is often compared to Alakazam, as both are fast Psychic-types\nwith Recover, but Starmie has some specific defensive uses due to its\nmovepool, higher Defense, and secondary Water typing. It is a much\nbetter check to Clamp Cloyster and Jynx, as well as Golem and Rhydon; in\nexchange, it loses coverage against Gengar, Jolteon, and Zapdos and the\nability to stay in against Chansey. Lastly, it's also worth noting that\nStarmie has the highest defense stats for a Recover or Soft-Boiled user\nin RBY, which often comes in handy when dealing with physical attackers\nsuch as Tauros.</p>\n"
        } ]
  },
  { "learnset" : [ "Bide",
        "Blizzard",
        "Body Slam",
        "Double-Edge",
        "Double Team",
        "Earthquake",
        "Fire Blast",
        "Fissure",
        "Horn Drill",
        "Hyper Beam",
        "Ice Beam",
        "Leer",
        "Mimic",
        "Rage",
        "Rest",
        "Skull Bash",
        "Stomp",
        "Strength",
        "Substitute",
        "Tackle",
        "Tail Whip",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Toxic"
      ],
    "pokemon" : "tauros",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>First of all, if opting for any of the following moves, use them over\nEarthquake or Blizzard. Golem and Rhydon are generally more important to\ncover than Gengar; however, dropping Earthquake leaves Tauros completely\nworthless against Gengar, while if Tauros forgoes Blizzard, he will\nstill be able to 3HKO Golem and Rhydon with Earthquake.</p>\n<p>Thunderbolt and Thunder are Tauros's best options against Cloyster, who\nonly takes around 22% from Body Slam. Thunder 2HKOes Cloyster, but\nThunderbolt also 2HKOes him after Body Slam. You should only consider\nthis change if partial-trapping moves are allowed though, as Cloyster is\notherwise very uncommon. Substitute is an interesting option on Tauros,\nas a common way to deal with him is to sacrifice a low health or\nsleeping Pokemon to him, so that something else can switch in without\ntaking a hit. However, getting a Substitute up is not as game-breaking\nas it might seem, as Substitute does not block status moves such as\nThunder Wave and Sleep Powder in RBY, and almost all Pokemon, including\nChansey, can break Tauros's Substitutes in one shot.</p>\n<h1>Checks and Counters</h1>\n<p>Tauros is the most dangerous and threatening Pokemon in OU, and there is\nvery little that can counter him. Some Water- or Ice-types, such as\nLapras, Slowbro, Articuno, and especially Cloyster, are bulky enough to\ntake a few hits, but they need to be at maximum health or a critical hit\nBody Slam could put them into the KO range of Hyper Beam. If healthy,\nExeggutor and Starmie can try to switch into Tauros and threaten him\nwith paralysis-inducing moves. Exeggutor in particular is decently\nbulky, while Starmie is one of the few Pokemon able to outspeed Tauros,\nbut it's more fragile and risks being paralyzed by Body Slam. Snorlax\nmakes a semi-reliable Tauros check, as Snorlax can deal good damage to\nalmost anything that switches in, forcing Tauros to stay in. Snorlax can\nalso use Counter to deal upwards of 80% to Tauros, though Hyper Beam\nwill hurt. Zapdos can threaten Tauros with Thunder Wave and STAB\nThunderbolt, which will cripple Tauros before going down if forced to\nstay in, or even if Tauros wins that match-up.</p>\n<p>Chansey and Alakazam have no business switching into Tauros, but they\ncan threaten him with Thunder Wave. In fact, despite the high amounts of\ndamage they will take from Body Slam, it is highly recommended they stay\nin for the Thunder Wave, as a paralyzed Tauros is a lot easier to\nhandle. Alakazam can also outspeed Tauros and hit it hard with STAB\nPsychic, so that can be another way to deal with him. Packing Counter on\nChansey is another way to deal with Tauros, as she always OHKOs Tauros\nif she Counters a Body Slam. Like Snorlax, however, countering a Hyper\nBeam will be tough, as it can possibly OHKO her. Golem, Rhydon, and\nGengar can come into a predicted Body Slam; while they are 2HKOed by\nBlizzard or Earthquake, they might be able to bait a resisted move for a\nWater-type Pokemon or Exeggutor to switch into.</p>\n<p>Because most of Tauros's checks require full health when trying to\nswitch in, sometimes there will be nothing on your team that can take a\nBody Slam. When playing against Tauros, you should be prepared to let a\nweakened Pokemon die, as sacrificing the least relevant Pokemon lets you\nswitch in another one safely. In fact, you might find that your own\nTauros is the most reliable answer to your opponent's. You have probably\nkept your Tauros healthy for the late-game as well, and as such, it\nmight happen to be your only Pokemon that stands a chance against the\nfoe's Tauros.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>This is one of the most well-known sets in Pokemon history, or at least\nit was when RBY was famous. Body Slam is Tauros's main attack; it\nreaches a nice 127 Base Power after STAB, and packs not only Tauros's\ncritical hit rate of over 20%, but also a 30% chance of paralysis. Hyper\nBeam is almost twice as powerful, reaching 225 Base Power taking STAB\ninto account, but it should generally be used as a finisher move to\navoid the recharge turn. A one-two of Body Slam followed by Hyper Beam\ncan do over 75% to the majority of the RBY metagame, making Tauros able\nto 2HKO most Pokemon at full health if he scores a critical hit. It is\nfurther worth noting that a critical hit Hyper Beam alone can net Tauros\nOHKOs, so it can also be used as a last-resort move if you have no other\nchoice.</p>\n<p>The last two moves provide Tauros with type coverage. Earthquake lets\nTauros 2HKO Gengar, who is immune to Normal-type attacks and takes\nspecial attacks with ease. It also hits Jolteon for super effective\ndamage. Furthermore, Earthquake is useful for checking Pokemon that use\nCounter, such as Chansey, while still dealing good damage to them.\nLastly, Blizzard allows Tauros to 2HKO Golem and Rhydon, and also hits\nExeggutor and Zapdos slightly harder than Body Slam does.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Body Slam" ],
                    [ "Hyper Beam" ],
                    [ "Earthquake" ],
                    [ "Blizzard" ]
                  ],
                "name" : "Standard",
                "natures" : [  ]
              } ],
          "overview" : "<p>Tauros is one of the most powerful Pokemon in RBY OU, and by far the\nmost dangerous one. Normal is the best offensive type in OU, with no\nreal weaknesses (as Fighting-type attacks are almost never seen in OU)\nand two powerful STAB physical attacks in Body Slam and Hyper Beam.\nTauros boasts a great 298 Attack stat and a great Speed stat, which\nleaves him outrun only by Alakazam, Starmie, Jolteon, and Persian, all\nof whom are fragile. Moreover, said high Speed stat gives Tauros a\ncritical hit rate of 21.5%, making him even more dangerous. Tauros's\ndefensive stats are also respectable, and, along with his typing and\nattacking options, allows him to go one-on-one against almost every\nPokemon in the game if necessary. This makes Tauros a good Pokemon to\nfall back on defensively late in the game when none of your other\nremaining Pokemon stand a chance against a certain threat, such as\nopposing Tauros, Snorlax, Zapdos, Persian, or Jolteon. Due to the\noffensive and defensive impact he has, Tauros can potentially clean up\ninjured teams and sometimes turn the tables on lost games with a little\nluck. However, Tauros should be saved for the end, or only be sent in\nearly to capitalize on weakened or sleeping opponents. All in all,\nTauros should be an automatic entry when making a competitive RBY OU\nteam.</p>\n"
        } ]
  },
  { "learnset" : [ "Acid",
        "Bide",
        "Body Slam",
        "Cut",
        "Double-Edge",
        "Double Team",
        "Growth",
        "Hyper Beam",
        "Mega Drain",
        "Mimic",
        "Poison Powder",
        "Rage",
        "Razor Leaf",
        "Reflect",
        "Rest",
        "Slam",
        "Sleep Powder",
        "Solar Beam",
        "Stun Spore",
        "Substitute",
        "Swords Dance",
        "Take Down",
        "Toxic",
        "Vine Whip",
        "Wrap"
      ],
    "pokemon" : "victreebel",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>There's really nothing else for Victreebel to do besides the sets listed above. Growth can raise Victreebel's Special, but the boost doesn't matter when using Razor Leaf since critical hits don't take into account the boost. Reflect can raise his Defense a bit which can be useful on the Wrapper set. Mimic can maybe get you Earthquake to smack Gengar, but that's highly unlikely.</p>\n<h1>Checks and Counters</h1>\n<p>Gengar completely walls Victreebel, since it resists Razor Leaf and is immune to Body Slam and Hyper Beam; it does not like being paralyzed by Victreebel's Stun Spore, though. Zapdos, Moltres, and Articuno take very little damage from Razor Leaf and can hit back with a STAB super effective attack (Drill Peck, Fire Blast, Ice Beam, respectively), although, just like for Venusaur, the three birds must beware of paralysis, especially Zapdos and Moltres. Psychic-types (except Starmie and Slowbro) can come in on a Razor Leaf and can do substantial damage to Victreebel with a STAB super effective Psychic.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>Victreebel has the attack stats to pull off a mixed sweeper role effectively--the problem lies in its mediocre Speed. If you save Victreebel for late-game or when the majority of the opponent's Pokemon are paralyzed, it will cause havoc. A Swords Dance-boosted Body Slam will cause huge damage to anything not named Golem or Rhydon, which Razor Leaf can take care of quite easily. Sleep Powder gives Victreebel a turn to Swords Dance while the opponent switches or stays in and does nothing.</p>\n<p>The Body Slam versus Hyper Beam decision is entirely up to preference, but Body Slam has a slight edge. Hyper Beam is more powerful, but if it doesn't OHKO the opponent's Pokemon, Victreebel will be hurt during its recharging turn. Body Slam is a much more consistent attack, due to the lack of a recharging turn and the bonus of paralysis. Predicting a switch and inflicting paralysis with Body Slam keeps Victreebel alive and healthy to continue sweeping.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Razor Leaf" ],
                    [ "Swords Dance" ],
                    [ "Sleep Powder" ],
                    [ "Hyper Beam",
                      "Body Slam"
                    ]
                  ],
                "name" : "Swords Dance",
                "natures" : [  ]
              },
              { "abilities" : [  ],
                "description" : "<p>As said before, Victreebel is an amazing late-game Pokemon. Bring this in on any paralyzed Pokemon and proceed to use Wrap to whittle down your opponent's health until it's in range for a surefire OHKO from Razor Leaf or Hyper Beam, rinse, and repeat. Stun Spore is in this set to paralyze anything faster than Victreebel so that it can use Wrap more effectively. This set relies heavily on the opponent's being slower or paralyzed, since, if it isn't, Victreebel will be at a severe disadvantage and very ineffective for the most part.</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Razor Leaf" ],
                    [ "Stun Spore" ],
                    [ "Wrap" ],
                    [ "Hyper Beam" ]
                  ],
                "name" : "Wrapper",
                "natures" : [  ]
              }
            ],
          "overview" : "<p>Victreebel is one of the best Grass-types due to its great Attack and Special, letting it hit opponents hard from both sides. It can use Swords Dance effectively with Body Slam and Hyper Beam, maxing its Attack after two uses of Swords Dance. Razor Leaf OHKOs Rock / Ground Pokemon that think they can wall Victreebel's Normal attacks, and will cause massive damage to any Water-types. However, it is limited in its effectiveness due to it low Speed and weakness to Psychic. All in all, Victreebel is a great Pokemon to bring in on a paralyzed team, because of its ability to sweep with either of its sets quite easily.</p>\n"
        } ]
  },
  { "learnset" : [ "Agility",
        "Bide",
        "Double-Edge",
        "Double Team",
        "Drill Peck",
        "Flash",
        "Fly",
        "Hyper Beam",
        "Light Screen",
        "Mimic",
        "Rage",
        "Razor Wind",
        "Reflect",
        "Rest",
        "Sky Attack",
        "Substitute",
        "Swift",
        "Take Down",
        "Thunder",
        "Thunderbolt",
        "Thunder Shock",
        "Thunder Wave",
        "Toxic",
        "Whirlwind"
      ],
    "pokemon" : "zapdos",
    "strategies" : [ { "comments" : "<h1>Other Options</h1>\n<p>Rest removes any status and helps to keep Zapdos alive, but can be tough\nto pull off, and Zapdos would be better off attacking. Thunder can OHKO\nStarmie and Slowbro without a critical hit, and will 2HKO Tauros, but\nonly has a 70% chance of hitting. Mimic is used to steal any incoming\nGolem or Rhydon's Earthquakes, thus letting Zapdos damage these two.\nUnfortunately, Mimic has some inherent flaws that limit its\neffectiveness. It only has a 25% chance of copying Earthquake and even\nthen it can only do about 30 to 37%, effectively a 3HKO, while Golem and\nRhydon will 2HKO with Rock Slide. Toxic can be used to hit Golem and\nRhydon on the switch and making them take damage every time they do\nswitch in. Reflect and Light Screen can be used to tank, but are not\nrecommended on the same set together. Coupled with Rest, Zapdos can stay\nalive for quite a long time.</p>\n<h1>Checks and Counters</h1>\n<p>Golem and Rhydon are its best counters; Zapdos cannot hurt either of\nthem and they can do whatever they want as Zapdos will be forced to\nswitch or be 2HKOed by Rock Slide. Chansey can come in on Thunderbolt\nand take very little damage, and is only 3HKOed by Drill Peck. This lets\nChansey use Thunder Wave or Ice Beam and then Soft-Boiled to regain its\nHP. Be wary, though, as one untimely critical hit can ruin Chansey.\nOther Electric-types, such as Jolteon and Raichu, will take very little\ndamage from either of Zapdos's attacks and will hit back with a neutral\nThunderbolt for a decent amount of damage.</p>\n",
          "format" : "OU",
          "movesets" : [ { "abilities" : [  ],
                "description" : "<p>This set takes full advantage of Zapdos's superb stats. It has an\namazing Special backed up by a very good Attack, and combined with its\ndecent Speed, it can and will cause some havoc. The problem lies in its\ninability to hurt Rock / Ground types such as Golem and Rhydon, which\nhappen to be on nearly every RBY team. Remove these threats and Zapdos\ncan wreck opposing teams.</p>\n<p>Thunderbolt coupled with Drill Peck will cause some very good damage to\nanything not named Golem or Rhydon (or any other Rock / Ground). Thunder\nWave can slow down any incoming Pokemon so they can be easy pickings for\nZapdos later on in the match. The fourth move is a wild card and\ncompletely up to the user. All of these moves have their advantages but\nnone outshines the rest.</p>\n<p>Agility causes Zapdos to become faster than everything else and ignores\nthe Speed drop that comes with paralysis (Zapdos can still become fully\nparalyzed, however).</p>\n",
                "evconfigs" : [  ],
                "items" : [  ],
                "ivconfigs" : [  ],
                "moveslots" : [ [ "Thunderbolt" ],
                    [ "Drill Peck" ],
                    [ "Thunder Wave" ],
                    [ "Agility" ]
                  ],
                "name" : "Mixed Attacker",
                "natures" : [  ]
              } ],
          "overview" : "<p>Zapdos is an incredibly good Pokemon, but its main counters, Golem and\nRhydon, are on a vast majority of RBY teams, thus limiting its\neffectiveness. It does a paltry 10% to these two with Drill Peck, and it\ncannot hit them with any of its Electric moves. The best way to use\nZapdos (along with almost any other Electric) is to hide it for as long\nas you can and wait for Golem/Rhydon to be removed; then, and only then,\nshould you show your Zapdos. As a late-game sweeper, Zapdos is nearly\nunrivaled because of its amazing mixed sweeping capabilities.</p>\n"
        } ]
  }
]